{
  "backend/main.mo": "Main Motoko actor for the bird atlas app, defining data types (BirdData, LocationEntry, TeamMember, etc.) and managing bird records, user profiles, team members, contact data, and access control using OrderedMap collections and BlobStorage mixin.",
  "feature_evidence.json": "Feature evidence report documenting a single implemented feature: updating the 'Zone' column in BirdDataTable.tsx so that cells displaying 'Tropical' render '40' instead, with high confidence and test ID REQ-119.",
  "frontend-file-summaries.txt": "JSON file containing one-sentence summaries of all frontend source files, serving as a reference index for the project's React component and hook implementations.",
  "frontend/index.html": "Root HTML entry point for the Arabic RTL React app, setting the page title, favicon, theme color, and mounting the React app via /src/main.tsx.",
  "frontend/src/App.tsx": "Main application file that configures TanStack Router with all routes (home, data, gallery, bird details, map, eagle-owl, statistics, image-view, permissions), wraps them in a shared RootLayout with QueryClientProvider, MainHeader, and ErrorBoundary, and lazy-loads all page components.",
  "frontend/src/components/AllLocationsMap.tsx": "Interactive map component that dynamically loads Leaflet.js from CDN, fetches all bird location data from the backend, renders OpenStreetMap tiles with amber circular markers, and supports filtering by bird name with auto-fitting bounds.",
  "frontend/src/components/BirdDataTable.tsx": "RTL Arabic bird data table component that flattens BirdData into per-location rows, supports inline editing and CSV export, and maps latitude to a climate zone where both equatorial (0–23.5°) and tropical (23.5–35°) ranges display '40' in the Zone column.",
  "frontend/src/components/BirdDetailsPage.tsx": "Displays a detailed view of a single bird including its main image, sub-images, audio player, and metadata, fetched by name from the route parameter. Handles loading, error, and not-found states with navigation back to home.",
  "frontend/src/components/BirdGallery.tsx": "Renders a gallery of all birds with support for adding and deleting birds via modals, including file uploads for images and audio. Uses React Query mutations and blob storage hooks for data management.",
  "frontend/src/components/BirdSelector.tsx": "A dropdown selector component for choosing a bird by name from a provided list, with a loading skeleton state. Renders an RTL-styled select element with a chevron icon.",
  "frontend/src/components/DeferredComponent.tsx": "Delays rendering of child components by a priority-based timeout to reduce initial memory load. Shows a static placeholder or spinner until the delay elapses, with error handling.",
  "frontend/src/components/DesertOwlScene.tsx": "Displays a hero scene for the desert owl by detecting WebGL support, but always falls back to a static image to avoid memory issues. Shows a loading spinner while WebGL detection is pending.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "Empty file with no content.",
  "frontend/src/components/EagleOwlPage.tsx": "Displays a dedicated page for eagle owl (Bubo bubo) birds, filtering all bird and location data by owl-related keywords. Shows stats, a bird list, and sighting locations with loading and error states.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches rendering errors, auto-retries once after 3 seconds, and shows a user-friendly error UI with manual retry and home navigation options.",
  "frontend/src/components/ExcelUploader.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "A top-level React error boundary that catches unhandled errors app-wide and displays a full-page Arabic error message with a reload button that clears session storage.",
  "frontend/src/components/HamburgerMenu.tsx": "A responsive hamburger menu component that renders a dropdown navigation list with Arabic labels and icons, closing on outside clicks or Escape key.",
  "frontend/src/components/ImageViewPage.tsx": "A full-screen image viewer page that supports zoom, rotation, and reset controls, loading the image URL from browser history state.",
  "frontend/src/components/Interactive3DMap.tsx": "A 3D map component using React Three Fiber that renders a textured plane of Al-Buraimi with orbit controls, automatically falling back to a static 2D image when WebGL is unsupported or on mobile.",
  "frontend/src/components/Interactive3DOwl.tsx": "A 3D owl sprite component using React Three Fiber with a transparent texture, falling back to a plain image tag when WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "A paginated gallery grid component that progressively loads items in batches and auto-loads more on scroll to prevent memory overflow.",
  "frontend/src/components/LazyMapComponent.tsx": "A deferred loading wrapper for map components that shows an animated placeholder until the map is ready to render.",
  "frontend/src/components/MainHeader.tsx": "The sticky site header with logo, desktop navigation links, Internet Identity login/logout, a refresh button, and a hamburger menu for mobile.",
  "frontend/src/components/MapView.tsx": "Renders an interactive Leaflet map showing bird sighting locations with markers and image popups, dynamically loading Leaflet from CDN and filtering out invalid coordinates.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "Displays a temporary Arabic notification banner with a countdown when a memory recovery reload is detected via sessionStorage.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Embeds the official Al Buraimi Governorate map from Oman's National Survey Authority website in a responsive iframe.",
  "frontend/src/components/OwlDataTable.tsx": "Empty file with no content.",
  "frontend/src/components/OwlGallery.tsx": "Provides an audio player UI for a bird's sound file, fetching the audio path and URL via hooks and toggling play/pause state.",
  "frontend/src/components/OwlImage.tsx": "Empty file with no content.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty file with no content.",
  "frontend/src/components/PermissionManagement.tsx": "Admin-only page for assigning user roles by principal ID, with authentication and authorization checks before rendering the role assignment form.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "Lazily loads the Interactive3DOwl component with a static image placeholder fallback, handling load errors and a deferred rendering strategy to reduce memory pressure.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty file with no content.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen animated splash screen displaying the app title, an owl image, and an enter button with a fade-out transition before calling the onEnter callback.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "Renders a static, non-interactive 3D map of Al Buraimi Governorate using React Three Fiber, displaying a textured plane with realistic lighting. Camera and orbit controls are fixed to prevent user interaction.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "Displays a static map image of Al Buraimi, loading it from blob storage if an active map reference exists or falling back to a local asset. Admin users can upload a new map image via a file input.",
  "frontend/src/components/StatisticsPage.tsx": "Shows bird observation statistics including total bird species, observation locations, and audio file counts, with a bar chart of top birds by location count and a data table.",
  "frontend/src/components/TeamDataTable.tsx": "Renders a static display of project team members organized into followers, members, project manager, and designer roles using hardcoded Arabic names.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning an authenticated actor when an identity is present or an anonymous actor otherwise, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, login status, and control functions to child components.",
  "frontend/src/hooks/useMemoryOptimization.ts": "Monitors browser JS heap memory usage on an interval and triggers a page reload with session storage cleanup when usage exceeds a critical threshold, also exposing warning notifications and usage formatting.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating bird data, locations, and user profiles via an ICP actor, including queries for bird details, location counts, and user roles.",
  "frontend/src/index.css": "Global stylesheet using Tailwind CSS with a desert wildlife theme, defining CSS custom properties for light/dark modes, splash screen styles, and RTL Arabic layout settings.",
  "frontend/src/lib/csvExport.ts": "Exports bird data to a UTF-8 BOM CSV file with Arabic headers, formatting location entries and coordinates into readable strings.",
  "frontend/src/lib/excelExport.ts": "Exports bird data to an Excel-compatible CSV file with Arabic headers and UTF-8 BOM encoding, using native browser APIs without external dependencies.",
  "frontend/src/lib/memoryManager.ts": "Implements a memory monitoring and auto-recovery system that tracks JS heap usage, triggers callbacks at configurable warning/critical thresholds, and coordinates registered recovery routines.",
  "frontend/src/lib/pdfExport.ts": "Generates a printable RTL Arabic HTML page from bird data and opens it in a new window to trigger the browser's print/PDF dialog.",
  "frontend/src/lib/requiredAssets.ts": "Defines and validates a registry of required static asset paths at module load time, exposing them as typed constants with a helper accessor function.",
  "frontend/src/lib/webglDetector.ts": "Utility module that detects WebGL support (versions 1 and 2) and mobile device status, providing helper functions to determine if a fallback should be used. Also includes bird name normalization and comparison utilities.",
  "frontend/src/main.tsx": "React app entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BirdDataPage.tsx": "Page component that displays the bird data table with navigation links back to the home page, rendered in RTL layout.",
  "frontend/src/pages/HomePage.tsx": "Main home page featuring a splash screen, navigation cards to app sections, custom map image upload with drag-and-drop, and an owl sound effect on click.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, border radius, box shadows, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state tracking file (version 127) documenting the bird distribution tracker app's architecture, known issues across deployments, and existing features for Al Buraimi Governorate.",
  "unknown.txt": "Empty file with no content."
}