{
  "backend/main.mo": "Main Motoko actor for the bird atlas app, defining data types (BirdData, LocationEntry, TeamMember, etc.) and exposing CRUD operations for birds, user profiles, team members, contact data, and access control, with blob storage and migration support.",
  "backend/migration.mo": "Motoko migration module that defines old and new actor state shapes and transforms OldBirdData to NewBirdData by adding the `mainImage` field, enabling safe canister upgrades.",
  "feature_evidence.json": "Feature evidence report listing three BirdGallery-scoped features: immediate gallery refresh after bird creation, visible edit button per card, and file upload inputs in the edit dialog for replacing images and audio.",
  "frontend-file-summaries.txt": "Auto-generated text file containing short summaries of each frontend source file, describing component responsibilities, hook fixes, and UI/UX details across the application.",
  "frontend/index.html": "Root HTML entry point for the React app, configured for Arabic RTL with an owl favicon, viewport meta, and a mount point for the React root.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with all application routes (home, data, gallery, map, bird details, eagle-owl, statistics, image-view, permissions), a shared RootLayout with QueryClientProvider and MainHeader, and lazy-loaded page components.",
  "frontend/src/components/AllLocationsMap.tsx": "Renders an interactive Leaflet map displaying all bird sighting locations, with filtering by bird species and toggle visibility of markers. Dynamically loads Leaflet from CDN and builds markers from bird location data fetched via React Query.",
  "frontend/src/components/BirdDataTable.tsx": "Displays a searchable, sortable table of all bird records with admin-gated CRUD operations (add, edit, delete) and export functionality to CSV, Excel, and PDF formats.",
  "frontend/src/components/BirdDetailsPage.tsx": "Shows a detailed view page for a single bird identified by URL param, including its main image, sub-images, audio player, and metadata, with loading and error states.",
  "frontend/src/components/BirdGallery.tsx": "Renders a card-based gallery of all birds with search, detail modal, and admin-only add/edit/delete dialogs including file upload support for images and audio.",
  "frontend/src/components/BirdSelector.tsx": "A simple RTL dropdown component for selecting a bird by name from a provided list, with a loading skeleton state.",
  "frontend/src/components/DeferredComponent.tsx": "A wrapper component that delays rendering of its children by a priority-based timeout to reduce initial memory load, showing a placeholder or spinner in the meantime.",
  "frontend/src/components/DesertOwlScene.tsx": "Displays a hero scene image of a desert owl with WebGL detection logic, always falling back to a static image to avoid memory issues during build.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "Empty file with no content.",
  "frontend/src/components/EagleOwlPage.tsx": "A page component displaying information about the Eagle Owl (Bubo bubo) in Al Buraimi, filtering bird data and locations by owl-related keywords and showing stats, bird list, and sighting locations.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class component that catches rendering errors, auto-retries once after 3 seconds, and displays an Arabic error UI with manual retry and home navigation options.",
  "frontend/src/components/ExcelUploader.tsx": "An empty file with no content or exports.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "A top-level React error boundary that catches unhandled errors app-wide and renders a full-screen Arabic error message with a reload button that clears session/local storage.",
  "frontend/src/components/HamburgerMenu.tsx": "A responsive hamburger navigation menu component with a dropdown listing seven app routes, supporting click-outside and Escape key dismissal.",
  "frontend/src/components/ImageViewPage.tsx": "A full-screen image viewer page that reads an image URL from history state and provides zoom, rotation, and reset controls.",
  "frontend/src/components/Interactive3DMap.tsx": "A 3D map component using React Three Fiber that renders an interactive WebGL map of Al Buraimi, with automatic fallback to a static 2D image when WebGL is unsupported or on mobile.",
  "frontend/src/components/Interactive3DOwl.tsx": "A 3D owl sprite component using React Three Fiber that renders a transparent owl texture with optional rotation/zoom controls, falling back to a plain image if WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "A progressive-loading gallery grid component that renders items in batches and auto-loads more on scroll to prevent memory overflow.",
  "frontend/src/components/LazyMapComponent.tsx": "A lazy-loading wrapper for map components that shows an animated placeholder while deferring map initialization using DeferredComponent.",
  "frontend/src/components/MainHeader.tsx": "The sticky site header with logo, desktop navigation links, refresh button, and Internet Identity login/logout functionality.",
  "frontend/src/components/MapView.tsx": "A Leaflet-based map component that dynamically loads the library, renders location markers with optional popup images, and centers on Al Buraimi Governorate.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "A temporary notification banner that appears after a memory-recovery page reload, auto-dismissing after a 5-second countdown.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Displays the official Al Buraimi Governorate map from Oman's National Survey Authority via a responsive, sandboxed iframe.",
  "frontend/src/components/OwlDataTable.tsx": "Empty file with no content.",
  "frontend/src/components/OwlGallery.tsx": "An audio player component that fetches and plays a bird's audio file from blob storage, with play/pause toggle controls.",
  "frontend/src/components/OwlImage.tsx": "Empty file with no content.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty file with no content.",
  "frontend/src/components/PermissionManagement.tsx": "An admin-only page for assigning user roles via Internet Identity, with access guards for unauthenticated and non-admin users.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "A wrapper component that lazily loads the Interactive3DOwl 3D component with a 300ms delay, showing a static owl image as a placeholder during loading or on error.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty file with no content or exports.",
  "frontend/src/components/SplashScreen.tsx": "A full-screen splash screen displaying the owl image, project title in Arabic/English, and an enter button with fade-out transition animation before calling the onEnter callback.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "A non-interactive 3D map of Al Buraimi Governorate rendered with React Three Fiber, displaying an official map texture on a flat plane with realistic lighting and a fixed camera angle.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "Displays the Al Buraimi map image fetched from blob storage (or a fallback static asset), and allows admin users to upload a new map image.",
  "frontend/src/components/StatisticsPage.tsx": "A statistics dashboard showing total bird species, observation locations, and audio file counts, along with a bar chart and data table of per-bird location counts.",
  "frontend/src/components/TeamDataTable.tsx": "A static display component showing hardcoded team data including followers, members, project manager, and designer in styled Arabic-language cards.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an InternetIdentityProvider component that persists identity across page reloads.",
  "frontend/src/hooks/useMemoryOptimization.ts": "A React hook that monitors JS heap memory usage at regular intervals and triggers a page reload with session cache cleanup when usage exceeds critical thresholds. Returns current memory usage, a notification flag, and formatting/recovery utilities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating bird data, locations, user profiles, and map references from the backend actor. Each hook is conditionally enabled based on actor availability.",
  "frontend/src/index.css": "Global stylesheet using Tailwind CSS with a desert wildlife documentary theme, defining CSS custom properties for light/dark modes, Arabic font settings, RTL layout, and custom component styles like splash screen and shimmer animations.",
  "frontend/src/lib/csvExport.ts": "Utility that converts an array of BirdData objects to a UTF-8 BOM CSV file and triggers a browser download. Handles Arabic headers, location formatting, coordinate extraction, and proper CSV field escaping.",
  "frontend/src/lib/excelExport.ts": "Exports bird data to an Excel-compatible CSV file with Arabic headers and UTF-8 BOM encoding using native browser APIs. Formats each bird's fields and triggers a timestamped file download.",
  "frontend/src/lib/memoryManager.ts": "A class-based memory management system that periodically monitors JS heap usage and triggers registered recovery callbacks or a page reload when configurable warning/critical thresholds are exceeded. Supports start/stop monitoring and enforces a minimum interval between recovery attempts.",
  "frontend/src/lib/pdfExport.ts": "Utility that converts an array of BirdData into a printable Arabic HTML page and triggers the browser's print dialog for PDF export.",
  "frontend/src/lib/requiredAssets.ts": "Registers and validates required static asset paths (owl hero image and logo) at module load time, throwing errors if any path is missing.",
  "frontend/src/lib/webglDetector.ts": "Detects WebGL 1/2 support and mobile device status to determine whether a fallback renderer should be used; also exports bird-name normalization and comparison helpers.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BirdDataPage.tsx": "Page component that renders the BirdDataTable with a header and navigation buttons to return to the home page.",
  "frontend/src/pages/HomePage.tsx": "Home page that shows a splash screen on first visit, navigation cards to major app sections, an admin-only map upload area with drag-and-drop, and a team data table.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH-based design tokens, custom border radii, box shadows, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state manifest describing the current app summary, known issues (gallery not showing after bird add, missing edit option), and three scoped feature requests to fix gallery display, edit button visibility, and add image/audio upload in the edit dialog.",
  "unknown.txt": "Empty file with no content."
}