{
  "backend/main.mo": "Main Motoko actor for the bird atlas app, defining data types (BirdData, TeamMember, etc.) and providing CRUD operations for bird records, user profiles, team members, contact data, and access control using OrderedMap collections and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their target files, associated components, test IDs, and confidence levels — covering AllLocationsMap, BirdDataTable, and other frontend restorations.",
  "frontend-file-summaries.txt": "JSON dictionary mapping each frontend source file path to a short human-readable summary of its purpose and key implementation details, used as build planning reference.",
  "frontend/index.html": "Root HTML entry point for the React app, configured for Arabic RTL with the owl favicon, viewport meta tag, and a mount div for the Vite/React bundle.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with lazy-loaded routes for all pages (home, data, gallery, bird details, map, eagle-owl, statistics, image-view, permissions) wrapped in a QueryClientProvider and shared RootLayout with header and error boundaries.",
  "frontend/src/components/AllLocationsMap.tsx": "Interactive Leaflet/OpenStreetMap component that fetches bird location data from the backend, supports filtering by bird name via a dropdown with an 'All' option, auto-fits bounds to visible markers, and includes a show/hide map toggle and Return to Home button.",
  "frontend/src/components/BirdDataTable.tsx": "A data table component for displaying, searching, editing, adding, and deleting bird records, with admin-only controls and CSV export functionality.",
  "frontend/src/components/BirdDetailsPage.tsx": "A detail page component that displays full information about a single bird (names, description, images, audio) fetched by name from the route params.",
  "frontend/src/components/BirdGallery.tsx": "A gallery component for browsing bird cards with modals for adding new birds and uploading audio files, supporting image uploads and admin actions.",
  "frontend/src/components/BirdSelector.tsx": "A simple dropdown selector component for choosing a bird by name from a provided list, with a loading skeleton state.",
  "frontend/src/components/DeferredComponent.tsx": "A wrapper component that delays rendering of its children by a priority-based timeout to reduce initial memory load, showing a placeholder or spinner in the meantime.",
  "frontend/src/components/DesertOwlScene.tsx": "A scene component that detects WebGL support and renders a static hero image of a desert owl with a gradient overlay as a fallback to avoid memory issues.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "An empty file with no content.",
  "frontend/src/components/EagleOwlPage.tsx": "A page component dedicated to the Eagle Owl species, displaying filtered owl bird records and sighting locations with stats, a hero section, and links back to the home page.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class component that catches rendering errors, displays an Arabic error UI with retry options, and auto-retries once after 3 seconds.",
  "frontend/src/components/ExcelUploader.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "A top-level React error boundary that catches unhandled errors app-wide and shows an Arabic fallback UI with a reload button that clears session storage.",
  "frontend/src/components/HamburgerMenu.tsx": "A dropdown hamburger navigation menu with Arabic labels and icons for all main app routes, supporting click-outside and Escape key dismissal.",
  "frontend/src/components/ImageViewPage.tsx": "A full-screen image viewer component with zoom, rotation, and reset controls that reads the image URL from browser history state.",
  "frontend/src/components/Interactive3DMap.tsx": "A 3D map component using React Three Fiber that renders Al-Buraimi map with WebGL detection and automatic fallback to a static 2D image on unsupported devices.",
  "frontend/src/components/Interactive3DOwl.tsx": "A 3D owl sprite component using React Three Fiber with a transparent texture, WebGL detection, and a static image fallback when WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "A paginated gallery grid component that progressively loads items in batches with infinite scroll support and a manual load-more button.",
  "frontend/src/components/LazyMapComponent.tsx": "A progressive loading wrapper for map components that shows an animated Arabic placeholder while the map initializes, using DeferredComponent with a configurable delay.",
  "frontend/src/components/MainHeader.tsx": "The main sticky header component with logo, desktop navigation links, and login/logout functionality using Internet Identity, including an admin-only permissions link.",
  "frontend/src/components/MapView.tsx": "A Leaflet-based map component that dynamically loads the library, renders bird location markers with image popups, and filters out invalid coordinates.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "A temporary notification banner that displays an Arabic message with a countdown when the app detects a memory recovery event stored in sessionStorage.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Renders the official Al Buraimi Governorate map from Oman's National Survey Authority inside a responsive, lazily-loaded iframe.",
  "frontend/src/components/OwlDataTable.tsx": "Empty file with no content.",
  "frontend/src/components/OwlGallery.tsx": "An audio player component for a given bird that fetches and plays its associated audio file, showing play/pause controls or a fallback message if no audio is available.",
  "frontend/src/components/OwlImage.tsx": "Empty file with no content.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty file with no content.",
  "frontend/src/components/PermissionManagement.tsx": "An admin-only page for assigning user roles, guarding access by checking authentication and a hardcoded admin principal, with a form to assign roles to other users.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "A safe wrapper that dynamically imports the Interactive3DOwl component with error handling, showing a static owl image as a placeholder during loading or on failure.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty file with no content.",
  "frontend/src/components/SplashScreen.tsx": "Renders a full-screen Arabic/English splash screen with an owl image, project title, and an animated 'Enter' button that triggers a fade-out transition before calling the `onEnter` callback.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "Displays a static, non-interactive 3D map of Al Buraimi Governorate using React Three Fiber, loading an official map texture onto a flat plane with realistic lighting and a fixed camera angle.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "Shows a static map image of Al Buraimi, loading it from blob storage if an active map reference exists or falling back to a local asset, with an admin-only upload control for replacing the map.",
  "frontend/src/components/StatisticsPage.tsx": "Displays bird observation statistics including summary cards for total species, locations, and audio files, a Recharts bar chart of sightings per bird, and a data table, all fetched via custom query hooks.",
  "frontend/src/components/TeamDataTable.tsx": "Renders a static team roster UI with hardcoded lists of followers, members, a project manager, and a designer displayed in styled Arabic-language cards.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage ICP Internet Identity authentication state, including login, logout, and persisting identity across page reloads via `AuthClient`.",
  "frontend/src/hooks/useMemoryOptimization.ts": "A React hook that monitors JS heap memory usage at regular intervals, shows a warning notification at 50% usage, and triggers a page reload with session cache cleanup at 65% usage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating bird data (details, locations, images, audio, counts) and user profile/role data via an ICP actor.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines light/dark CSS custom properties for a desert-themed color palette, and includes styles for splash screen, image view pages, and site manager animations.",
  "frontend/src/lib/csvExport.ts": "Utility that converts an array of BirdData objects to a UTF-8 BOM CSV string with Arabic headers and triggers a browser file download with a timestamped filename.",
  "frontend/src/lib/excelExport.ts": "Utility that exports bird data to an Excel-compatible CSV file with Arabic headers and UTF-8 BOM, using native browser APIs without external dependencies.",
  "frontend/src/lib/memoryManager.ts": "A singleton-style MemoryManager class that periodically checks JS heap usage, fires warning/critical callbacks at configurable thresholds (50%/65%), and triggers automatic recovery via registered callbacks or a page reload.",
  "frontend/src/lib/pdfExport.ts": "Utility that converts an array of BirdData objects into a styled Arabic RTL HTML page and opens it in a new window to trigger the browser's print/PDF dialog.",
  "frontend/src/lib/requiredAssets.ts": "Defines and validates required static asset paths (owl hero image and logo) at module load time, exporting them as typed constants with a helper accessor.",
  "frontend/src/lib/webglDetector.ts": "Detects WebGL 1/2 support and mobile device status to determine whether a fallback renderer should be used; also exports bird-name normalization and comparison helpers.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BirdDataPage.tsx": "Page component that renders the BirdDataTable with a header and navigation links back to the home page.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a splash screen, hero section with clickable owl audio, navigation cards to app sections, a drag-and-drop custom map image uploader, and a team data table.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with oklch-based design tokens, custom border radii, box shadows, accordion animations, and the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata (version 117) tracking the app's summary, architectural notes, known deployment issues, and a list of existing features for the Al Buraimi bird distribution tracker.",
  "unknown.txt": "Empty file with no content."
}