{
  "backend/main.mo": "Main Motoko actor for the owl distribution atlas app, defining data types (BirdData, LocationEntry, TeamMember, etc.) and managing bird locations, user profiles, team members, contact data, and access control using ordered maps and blob storage mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing the purpose and key implementation details of each component, hook, and page.",
  "frontend/index.html": "HTML entry point for the Arabic RTL owl distribution atlas app, setting the page title, favicon, viewport, and mounting the React app at the root div.",
  "frontend/src/App.tsx": "Main React application file that sets up TanStack Router with all routes (home, data, gallery, map, bird details, eagle-owl, statistics, image-view, permissions), lazy-loads page components, and wraps everything in a shared root layout with QueryClientProvider, MainHeader, and MemoryRecoveryNotification.",
  "frontend/src/components/AllLocationsMap.tsx": "Interactive Leaflet map component that fetches all bird data, extracts location coordinates, renders filterable circle markers per bird species, and displays a detail panel when a marker is selected.",
  "frontend/src/components/BirdDataTable.tsx": "Admin-gated bird data table with search, multi-column sorting, CSV/Excel/PDF export, and dialogs for adding and editing bird records including location fields, using React Query hooks for backend CRUD operations.",
  "frontend/src/components/BirdDetailsPage.tsx": "Displays a detailed view of a single bird including its main image, sub-images, audio player, and metadata, fetched by bird name from the route parameter. Handles loading, error, and not-found states with navigation back to home.",
  "frontend/src/components/BirdGallery.tsx": "Admin-capable gallery component that lists all birds with search, add, edit, and delete functionality via dialogs. Supports uploading main images, sub-images, and audio files, with admin access checked via the actor.",
  "frontend/src/components/BirdSelector.tsx": "A simple RTL dropdown component for selecting a bird by name from a provided list. Shows a loading skeleton while data is being fetched.",
  "frontend/src/components/DeferredComponent.tsx": "A wrapper component that delays rendering of its children by a priority-based timeout to reduce initial memory load. Shows a placeholder or spinner until the delay elapses, with error handling.",
  "frontend/src/components/DesertOwlScene.tsx": "Renders a hero scene for the desert owl, detecting WebGL support but always falling back to a static image to avoid memory issues. Displays a gradient overlay with a title at the bottom.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "Empty file with no content.",
  "frontend/src/components/EagleOwlPage.tsx": "Displays a dedicated page for eagle owl (Bubo bubo) birds filtered from all bird data by owl-related keywords. Shows stats, a hero section, and lists of matching birds and observation locations.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches rendering errors, auto-retries once after 3 seconds, and shows a user-friendly Arabic error UI with manual retry and home navigation options.",
  "frontend/src/components/ExcelUploader.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "A top-level React error boundary that catches unhandled errors app-wide and displays a full-screen Arabic error message with a reload button that clears session storage.",
  "frontend/src/components/HamburgerMenu.tsx": "A responsive hamburger menu component that renders a dropdown navigation list with Arabic labels and icons for all main app routes, closing on outside click or Escape key.",
  "frontend/src/components/ImageViewPage.tsx": "A full-screen image viewer page that reads an image URL from history state and provides zoom, rotation, and reset controls along with navigation back buttons.",
  "frontend/src/components/Interactive3DMap.tsx": "A 3D map component using React Three Fiber that renders a textured plane of Al-Buraimi with orbit controls, automatically falling back to a static 2D image when WebGL is unsupported or on mobile.",
  "frontend/src/components/Interactive3DOwl.tsx": "A 3D owl sprite component using React Three Fiber that displays a transparent owl texture with optional orbit/zoom controls, falling back to a plain img tag if WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "A paginated gallery grid component that progressively renders items in batches, auto-loading more on scroll and providing a manual load-more button to prevent memory spikes.",
  "frontend/src/components/LazyMapComponent.tsx": "A deferred loading wrapper for map components that shows an animated placeholder until the map is ready, using DeferredComponent to delay initialization and reduce memory spikes.",
  "frontend/src/components/MainHeader.tsx": "The sticky app header with logo, desktop navigation links, Internet Identity login/logout handling, a data refresh button, and a hamburger menu for smaller screens.",
  "frontend/src/components/MapView.tsx": "Renders an interactive Leaflet map showing bird sighting locations with coordinate validation, custom markers, and popup images loaded from blob storage.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "Displays a temporary Arabic notification banner when a memory-recovery page reload is detected via sessionStorage, auto-dismissing after a 5-second countdown.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Embeds the official Al Buraimi Governorate map from Oman's National Survey Authority in a responsive iframe.",
  "frontend/src/components/OwlDataTable.tsx": "Empty file with no content.",
  "frontend/src/components/OwlGallery.tsx": "Fetches and plays an audio file associated with a given bird name, showing play/pause controls and loading/empty states.",
  "frontend/src/components/OwlImage.tsx": "Empty file with no content.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty file with no content.",
  "frontend/src/components/PermissionManagement.tsx": "Admin-only page that allows assigning user roles via Internet Identity, with guards for unauthenticated and non-admin users.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "Lazily loads an Interactive3DOwl component with a static image placeholder during loading or on error, using deferred rendering to reduce memory pressure.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty file with no content.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen Arabic splash screen with an owl image, project title, and an enter button that triggers a fade-out transition before revealing the main app.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "Renders a static, non-interactive 3D map of Al Buraimi Governorate using React Three Fiber, displaying a textured plane with realistic lighting. Camera and orbit controls are fixed to prevent user interaction.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "Displays a static map image of Al Buraimi, loading it from blob storage if an active map reference exists or falling back to a local asset. Admin users can upload a new map image via a file input.",
  "frontend/src/components/StatisticsPage.tsx": "Shows bird observation statistics including total bird species, observation locations, and audio file counts, with a bar chart of top birds by location count and a data table.",
  "frontend/src/components/TeamDataTable.tsx": "Renders a static display of project team members organized into followers, members, project manager, and designer roles using hardcoded Arabic names.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning an authenticated actor when an Internet Identity is present or an anonymous actor otherwise. Invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, login status, and control functions to child components.",
  "frontend/src/hooks/useMemoryOptimization.ts": "Monitors JS heap memory usage on a 5-second interval, showing a warning notification above 50% usage and triggering a page reload with session cache clearing above 65% usage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating bird data (names, details, locations, counts) and user profiles via a canister actor, with cache invalidation on mutations.",
  "frontend/src/index.css": "Global stylesheet using Tailwind CSS with a desert/sand-themed CSS variable palette for light and dark modes, plus custom styles for splash screen, owl images, and mobile responsiveness.",
  "frontend/src/lib/csvExport.ts": "Exports an array of BirdData to a UTF-8 BOM CSV file with Arabic headers, formatting location entries and coordinates into pipe-separated strings.",
  "frontend/src/lib/excelExport.ts": "Exports bird data to an Excel-compatible CSV file with Arabic headers and UTF-8 BOM encoding, using native browser APIs without external dependencies.",
  "frontend/src/lib/memoryManager.ts": "Implements a MemoryManager class that periodically monitors JS heap usage, triggers configurable warning/critical callbacks, and runs registered recovery callbacks when memory exceeds reduced thresholds.",
  "frontend/src/lib/pdfExport.ts": "Exports bird data to a printable HTML page opened in a new browser window, styled for RTL Arabic layout and triggering the browser's print/PDF dialog automatically.",
  "frontend/src/lib/requiredAssets.ts": "Defines and validates a registry of required static asset paths at module load time, exposing them as typed constants with a helper accessor function.",
  "frontend/src/lib/webglDetector.ts": "Provides utilities to detect WebGL support (versions 1 and 2), identify mobile devices, and normalize/compare bird names for consistent matching.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/BirdDataPage.tsx": "Page component that displays the BirdDataTable with a header and navigation buttons to return to the home page, laid out RTL for Arabic.",
  "frontend/src/pages/HomePage.tsx": "Home page component featuring a splash screen, navigation cards to major app sections, admin-gated map upload functionality, and a team data table.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, border radii, box shadows, accordion keyframes, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project's versioned state, architectural notes, known issues, and existing features for a bird distribution tracker app targeting Al Buraimi Governorate.",
  "unknown.txt": "Empty file with no content."
}