{
  "backend/main.mo": "Main Motoko actor defining data types (BirdData, TeamMember, etc.) and backend logic for a bird atlas app, including CRUD operations, access control, blob storage, and user profile management.",
  "feature_evidence.json": "Feature evidence report listing implemented features with associated files, components, test IDs, and confidence levels — primarily documenting admin action button restoration in BirdDataTable.tsx and BirdGallery.tsx.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key implementation details of each component, hook, and page in the application.",
  "frontend/index.html": "Root HTML entry point for the Arabic RTL owl atlas app, setting language, favicon, viewport meta, and mounting the React app via /src/main.tsx.",
  "frontend/src/App.tsx": "Main React application file configuring TanStack Router with all routes (home, data, gallery, map, bird details, eagle-owl, statistics, image-view, permissions), lazy-loaded components, a shared RootLayout with MainHeader, and a QueryClientProvider.",
  "frontend/src/components/AllLocationsMap.tsx": "Interactive Leaflet map component that fetches all bird records, extracts and memoizes location markers, supports per-bird filtering and marker visibility toggling, and lazily loads Leaflet from CDN.",
  "frontend/src/components/BirdDataTable.tsx": "A table component for managing bird data with CRUD operations (add, edit, delete), search filtering, admin role checking, and export functionality to CSV, Excel, and PDF formats.",
  "frontend/src/components/BirdDetailsPage.tsx": "A detail page for a single bird that displays its images, audio, and metadata fetched by name from the route parameter, with loading and error states.",
  "frontend/src/components/BirdGallery.tsx": "A gallery component displaying bird cards with image lightbox, inline editing for admins, audio file upload, and search functionality.",
  "frontend/src/components/BirdSelector.tsx": "A simple dropdown selector component for choosing a bird by name from a list, with a loading skeleton state.",
  "frontend/src/components/DeferredComponent.tsx": "A wrapper component that delays rendering of its children by a priority-based timeout to reduce initial memory load, with loading, placeholder, and error states.",
  "frontend/src/components/DesertOwlScene.tsx": "A scene component that detects WebGL support and renders a static hero image of a desert owl with a gradient overlay as a fallback to avoid memory issues.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "An empty file with no content.",
  "frontend/src/components/EagleOwlPage.tsx": "A page dedicated to the Eagle Owl species that filters bird and location data by owl-related keywords and displays stats, a hero section, and a list of matching birds.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class component that catches rendering errors, displays an Arabic error UI with retry options, and auto-retries once after 3 seconds.",
  "frontend/src/components/ExcelUploader.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "A top-level React error boundary that catches unhandled errors app-wide, displays an Arabic fallback UI, and offers a full page reload with session/storage clearing.",
  "frontend/src/components/HamburgerMenu.tsx": "A responsive hamburger navigation menu with seven Arabic-labeled routes, closing on outside click or Escape key, using Lucide icons.",
  "frontend/src/components/ImageViewPage.tsx": "A full-screen image viewer page supporting zoom, rotation, and reset controls, reading the image URL from browser history state.",
  "frontend/src/components/Interactive3DMap.tsx": "A 3D map component using React Three Fiber that renders Al-Buraimi map texture on a plane with orbit controls, falling back to a static 2D image when WebGL is unsupported or on mobile.",
  "frontend/src/components/Interactive3DOwl.tsx": "A 3D owl sprite component using React Three Fiber with a transparent texture, falling back to a plain img tag when WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "A paginated gallery grid that progressively loads items in batches with scroll-based auto-loading and a manual load-more button.",
  "frontend/src/components/LazyMapComponent.tsx": "A deferred wrapper for map components that shows an animated Arabic placeholder until the map is ready to render, using a configurable delay.",
  "frontend/src/components/MainHeader.tsx": "Sticky RTL header component with logo, desktop navigation links, login/logout via Internet Identity, and a query refresh button. Includes a hamburger menu for mobile.",
  "frontend/src/components/MapView.tsx": "Leaflet-based map component that dynamically loads the library, renders bird location markers with popups (including images), and centers on Al Buraimi Governorate.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "Displays a temporary Arabic notification banner with a countdown when a memory-recovery page reload is detected via sessionStorage.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Renders the official Al Buraimi Governorate map from Oman's National Survey Authority inside a responsive, sandboxed iframe.",
  "frontend/src/components/OwlDataTable.tsx": "Empty file with no content.",
  "frontend/src/components/OwlGallery.tsx": "Audio player component that fetches a bird's audio file path from the backend, resolves it to a URL, and provides play/pause controls.",
  "frontend/src/components/OwlImage.tsx": "Empty file with no content.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty file with no content.",
  "frontend/src/components/PermissionManagement.tsx": "Admin-only page that verifies the logged-in user's principal against a hardcoded admin ID and allows assigning roles to other users via the backend.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "Wrapper that lazily loads the Interactive3DOwl component with a 300ms delay, showing a static owl image as a placeholder during loading or on error.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty file with no content.",
  "frontend/src/components/SplashScreen.tsx": "Renders a full-screen Arabic/English splash screen with an owl image, project title, and an animated 'Enter' button that triggers a fade-out transition before calling the `onEnter` callback.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "Displays a static (non-interactive) 3D map of Al Buraimi Governorate using React Three Fiber, loading an official map texture onto a flat plane with realistic lighting and a fixed camera angle.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "Shows a static map image of Al Buraimi, loading it from blob storage if an active map reference exists or falling back to a local asset, with an admin-only upload control for replacing the map.",
  "frontend/src/components/StatisticsPage.tsx": "Displays bird observation statistics including summary cards for total bird species, locations, and audio files, a Recharts bar chart of locations per bird, and a data table, all fetched via React Query hooks.",
  "frontend/src/components/TeamDataTable.tsx": "Renders a static team roster UI showing hardcoded lists of project followers, members, a project manager, and a designer in a styled Arabic RTL grid layout.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor via React Query, using the current Internet Identity for authenticated calls or an anonymous actor otherwise, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage ICP AuthClient lifecycle, login/logout, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useMemoryOptimization.ts": "React hook that monitors JS heap memory usage at regular intervals, shows a warning notification at 50% usage, and triggers a page reload with session cache cleanup at 65% usage.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for fetching and mutating bird data, locations, user profiles, and roles.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind base/components/utilities, defines light and dark CSS custom properties for a desert wildlife theme, and includes styles for splash screen, image view, and mobile responsiveness.",
  "frontend/src/lib/csvExport.ts": "Utility that serializes an array of BirdData objects into a UTF-8 BOM CSV file with Arabic headers covering names, description, locations, coordinates, images, and audio, then triggers a browser download.",
  "frontend/src/lib/excelExport.ts": "Utility that exports bird data to an Excel-compatible CSV file with Arabic column headers and UTF-8 BOM encoding, using native browser APIs without external dependencies.",
  "frontend/src/lib/memoryManager.ts": "Singleton-style class that periodically checks JS heap usage, fires warning/critical callbacks at configurable thresholds (50%/65%), and triggers automatic recovery by clearing caches and reloading the page.",
  "frontend/src/lib/pdfExport.ts": "Utility that generates a styled Arabic RTL HTML table from bird data and opens it in a new browser window, automatically triggering the print dialog for PDF export.",
  "frontend/src/lib/requiredAssets.ts": "Defines and validates required static asset paths (hero image and owl logo) at module load time, throwing errors if any path is missing or empty.",
  "frontend/src/lib/webglDetector.ts": "Provides utilities to detect WebGL support and mobile devices, and includes helper functions to normalize and compare bird names by stripping whitespace, dashes, and special characters.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/BirdDataPage.tsx": "Page component that displays the bird data table with a header and back-navigation buttons linking to the home route.",
  "frontend/src/pages/HomePage.tsx": "Home page component featuring a splash screen, navigation cards to major app sections, admin-gated map upload functionality, and a team data table.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with oklch-based design tokens, custom border radii, box shadows, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the project's versioned state, architectural notes, known issues, and existing features for a bird distribution tracker app targeting Al Buraimi Governorate.",
  "unknown.txt": "Empty file with no content."
}