{
  "backend/main.mo": "Main Motoko actor for the owl distribution atlas app, defining data types (BirdData, TeamMember, etc.) and implementing CRUD operations for bird data, user profiles, team members, access control, blob storage, and contact/security question management.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no recorded features.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing the purpose and key behaviors of components, hooks, and pages in the project.",
  "frontend/index.html": "HTML entry point for the Arabic RTL owl distribution atlas app, setting the page title, favicon, viewport, and mounting the React app at the root div.",
  "frontend/src/App.tsx": "Main React application file that sets up TanStack Router with lazy-loaded routes (home, data, gallery, bird details, map, eagle-owl, statistics, image-view, permissions) and wraps everything in QueryClientProvider with error boundaries.",
  "frontend/src/components/AllLocationsMap.tsx": "Interactive bird locations map component that dynamically loads Leaflet.js via CDN, renders markers for all bird sighting coordinates fetched from the backend, and supports filtering by bird name.",
  "frontend/src/components/BirdDataTable.tsx": "Admin-capable bird data table with inline editing, add/delete functionality, search filtering, and CSV export, using React Query hooks for data fetching and mutations and gating edit controls behind admin role checks.",
  "frontend/src/components/BirdDetailsPage.tsx": "Displays detailed information for a single bird (names, description, images, audio) fetched by URL param, with loading/error states and a back-to-home link.",
  "frontend/src/components/BirdGallery.tsx": "Shows a gallery of all birds with blob-storage images, and includes modals for viewing full images and adding new birds (with file upload support) restricted to admin users.",
  "frontend/src/components/BirdSelector.tsx": "A dropdown select component that renders a list of bird names and calls a callback when the user picks one, with a loading skeleton state.",
  "frontend/src/components/DeferredComponent.tsx": "A wrapper component that delays rendering its children by a priority-based timeout to reduce initial memory load, showing a placeholder or spinner in the meantime.",
  "frontend/src/components/DesertOwlScene.tsx": "Renders a hero scene for the desert owl; detects WebGL support but always falls back to a static image to avoid memory issues, with a loading spinner while detecting.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "Empty file with no content.",
  "frontend/src/components/EagleOwlPage.tsx": "Displays a dedicated page for eagle owl (Bubo bubo) data, filtering all bird and location records by owl-related keywords and showing stats, bird list, and sighting locations.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class error boundary that catches render errors, auto-retries once after 3 seconds, and shows a user-friendly Arabic error UI with manual retry and home navigation options.",
  "frontend/src/components/ExcelUploader.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "A top-level React class error boundary that catches unhandled errors app-wide and displays a full-page Arabic error screen with a reload button that clears session storage.",
  "frontend/src/components/HamburgerMenu.tsx": "A responsive hamburger menu component that renders a dropdown navigation list with Arabic labels and icons, closing on outside clicks or Escape key press.",
  "frontend/src/components/ImageViewPage.tsx": "A full-screen image viewer page that supports zoom, rotation, and reset controls, loading the image URL from browser history state.",
  "frontend/src/components/Interactive3DMap.tsx": "A 3D map component using React Three Fiber that renders a textured plane of Al-Buraimi with orbit controls, automatically falling back to a static 2D image when WebGL is unsupported or on mobile.",
  "frontend/src/components/Interactive3DOwl.tsx": "A 3D owl sprite component using React Three Fiber with a transparent texture, falling back to a plain image tag when WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "A paginated gallery grid component that progressively loads items in batches, auto-loading more on scroll and showing a load-more button when additional items remain.",
  "frontend/src/components/LazyMapComponent.tsx": "A deferred loading wrapper for map components that shows an animated placeholder until the map is ready to render.",
  "frontend/src/components/MainHeader.tsx": "The sticky site header with logo, desktop navigation links, Internet Identity login/logout, a refresh button, and a hamburger menu for mobile, conditionally showing an admin permissions link.",
  "frontend/src/components/MapView.tsx": "Renders an interactive Leaflet map showing bird sighting locations with markers and image popups, dynamically loading Leaflet from CDN and filtering invalid coordinates.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "Displays a temporary Arabic notification banner when a memory recovery reload is detected via sessionStorage, auto-dismissing after a 5-second countdown.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Embeds the official Al Buraimi Governorate map from the Oman National Survey Authority website inside a responsive iframe.",
  "frontend/src/components/OwlDataTable.tsx": "Empty file with no content.",
  "frontend/src/components/OwlGallery.tsx": "Fetches and plays an audio file associated with a given bird name, showing play/pause controls and loading/empty states.",
  "frontend/src/components/OwlImage.tsx": "Empty file with no content.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty file with no content.",
  "frontend/src/components/PermissionManagement.tsx": "Admin-only page for assigning user roles via Internet Identity, with access guards for unauthenticated and non-admin users.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "Lazily loads the Interactive3DOwl component with a static image placeholder fallback, handling load errors and deferred rendering to reduce memory pressure.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty file with no content.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen animated splash screen displaying the app title, owl image, and an enter button with a fade-out transition before revealing the main app.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "Renders a static, non-interactive 3D map of Al Buraimi Governorate using React Three Fiber, displaying a textured plane with realistic lighting. Camera and orbit controls are fixed to prevent user interaction.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "Displays a static map image of Al Buraimi, loading it from blob storage if an active map reference exists or falling back to a local asset. Admin users can upload a new map image via a file input.",
  "frontend/src/components/StatisticsPage.tsx": "Shows bird observation statistics including total bird species, observation locations, and audio file counts, with a bar chart of top birds by location count and a data table.",
  "frontend/src/components/TeamDataTable.tsx": "Renders a static display of project team members organized into followers, members, project manager, and designer roles using hardcoded Arabic names.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning an authenticated actor when an identity is present or an anonymous actor otherwise, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, login status, and control functions to child components.",
  "frontend/src/hooks/useMemoryOptimization.ts": "Monitors browser JS heap memory usage on an interval and triggers a page reload with session cache cleanup when usage exceeds a critical threshold, also exposing warning notifications and usage formatting.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating bird data, user profiles, and map references via an ICP actor, with toast notifications for mutations.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, defines light/dark CSS custom properties for a desert wildlife theme, and includes styles for splash screen, RTL Arabic layout, and various UI components.",
  "frontend/src/lib/csvExport.ts": "Utility that converts BirdData arrays to UTF-8 BOM CSV strings with Arabic headers and triggers a browser file download.",
  "frontend/src/lib/excelExport.ts": "Exports BirdData arrays to an Excel-compatible CSV file with Arabic headers and a UTF-8 BOM, using native browser APIs.",
  "frontend/src/lib/memoryManager.ts": "Implements a singleton MemoryManager class that monitors JS heap usage at configurable intervals and triggers registered recovery callbacks when warning or critical thresholds are exceeded.",
  "frontend/src/lib/pdfExport.ts": "Generates a printable RTL Arabic HTML table from BirdData and opens it in a new browser window to trigger the native print/PDF dialog.",
  "frontend/src/lib/requiredAssets.ts": "Registers and validates required static asset paths at module load time, exporting a typed REQUIRED_ASSETS map and a helper getter.",
  "frontend/src/lib/webglDetector.ts": "Utility module that detects WebGL support (v1/v2) and mobile device status, providing fallback logic and helper functions for normalizing/comparing bird names.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BirdDataPage.tsx": "Page component that renders the BirdDataTable with a header and navigation links back to the home page, using RTL layout.",
  "frontend/src/pages/HomePage.tsx": "Home page component featuring a splash screen, navigation cards to app sections, custom map image upload with drag-and-drop, and an owl sound effect on click.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, border radii, box shadows, accordion keyframes, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata (version 97) tracking the app summary, architectural notes, known deployment issues, and a list of existing features for the Al Buraimi bird distribution tracker.",
  "unknown.txt": "Empty file with no content."
}