{
  "backend/main.mo": "Main Motoko actor for the bird atlas app, defining data types (BirdData, TeamMember, etc.) and providing CRUD operations for bird records, user profiles, team members, contact data, and access control using OrderedMap storage and BlobStorage mixin.",
  "feature_evidence.json": "Feature evidence report confirming that BirdDataTable.tsx implements Add/Edit/Save/Delete CRUD buttons for admin users with the desert/amber RTL Arabic theme, mapped to test requirement REQ-51.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing each component's purpose, key features, and recent changes for build planning reference.",
  "frontend/index.html": "Root HTML entry point for the React app, configured for Arabic RTL layout with the owl favicon, viewport meta tag, and amber theme color.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with lazy-loaded routes for home, gallery, bird details, map, eagle-owl, statistics, image-view, permissions, and the /data bird data page, all wrapped in an RTL root layout with a shared header.",
  "frontend/src/components/AllLocationsMap.tsx": "Displays all bird location pins on a static image map of Al Buraimi governorate, with clickable pins that show bird details in a sidebar, using coordinate-to-percentage projection within defined map bounds.",
  "frontend/src/components/BirdDataTable.tsx": "Bird data table component with full admin-only CRUD functionality, featuring an Add button in the toolbar, inline Edit/Save/Cancel per row, and a Delete button, all styled with the desert/amber RTL Arabic theme and restricted to authenticated admin users.",
  "frontend/src/components/BirdDetailsPage.tsx": "Displays detailed information for a single bird including an image carousel, audio player, and metadata, fetching data via custom hooks and resolving file URLs from blob storage.",
  "frontend/src/components/BirdGallery.tsx": "Renders a searchable, expandable grid gallery of all birds with images, supporting navigation to individual bird pages and filtering by name.",
  "frontend/src/components/BirdSelector.tsx": "A dropdown select component for choosing a bird by name from a list, with a loading skeleton state and RTL Arabic layout.",
  "frontend/src/components/DeferredComponent.tsx": "A wrapper component that delays rendering of its children by a priority-based timeout to reduce initial memory load, showing a placeholder or spinner in the meantime.",
  "frontend/src/components/DesertOwlScene.tsx": "Detects WebGL support and renders a static hero image of a desert owl scene with a gradient overlay, falling back gracefully on errors or unsupported environments.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "Empty file with no content.",
  "frontend/src/components/EagleOwlPage.tsx": "Displays a dedicated page for Eagle Owl (Bubo bubo) data, showing filtered bird records and observation locations matching owl-related keywords with summary stat cards.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches rendering errors, displays an Arabic error UI with retry and home navigation options, and auto-retries once after 3 seconds.",
  "frontend/src/components/ExcelUploader.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "A React class-based error boundary that catches unhandled errors app-wide and displays a styled Arabic error message with a reload button instead of a white screen.",
  "frontend/src/components/HamburgerMenu.tsx": "A dropdown hamburger navigation menu component with Arabic labels for main app routes, supporting outside-click and Escape-key dismissal.",
  "frontend/src/components/ImageViewPage.tsx": "A full-screen image viewer page with zoom, rotation, and reset controls that reads the image URL from browser history state.",
  "frontend/src/components/Interactive3DMap.tsx": "A 3D map component using React Three Fiber that renders an Al-Buraimi map texture on a plane with orbit controls, falling back to a static 2D image when WebGL is unsupported or on mobile.",
  "frontend/src/components/Interactive3DOwl.tsx": "A 3D owl sprite component using React Three Fiber with a transparent texture, falling back to a plain image tag when WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "A paginated gallery grid component that progressively loads items in batches and auto-loads more on scroll to prevent memory overflow.",
  "frontend/src/components/LazyMapComponent.tsx": "A deferred-loading wrapper for map components that shows an animated placeholder until the map is ready, using a DeferredComponent utility.",
  "frontend/src/components/MainHeader.tsx": "Sticky app header with logo, desktop navigation links, refresh button, and Internet Identity login/logout, with admin-only permissions link shown based on principal.",
  "frontend/src/components/MapView.tsx": "Leaflet-based map component that dynamically loads the library, renders location markers with optional popup images, and centers on Al Buraimi Governorate.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "Fixed-position notification banner that displays a memory-recovery message with a countdown timer and auto-dismisses after 5 seconds.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Renders the official Al Buraimi Governorate map from Oman's National Survey Authority inside a responsive, sandboxed iframe.",
  "frontend/src/components/OwlDataTable.tsx": "Empty file with no content.",
  "frontend/src/components/OwlGallery.tsx": "Audio player component for a named bird that fetches and plays its audio file, showing play/pause controls or a placeholder when no audio is available.",
  "frontend/src/components/OwlImage.tsx": "Empty file with no content.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty file with no content.",
  "frontend/src/components/PermissionManagement.tsx": "Admin-only page for assigning user roles via Internet Identity principal, with access guards for unauthenticated and non-admin users.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "Wrapper that lazily loads the Interactive3DOwl 3D component with a static image placeholder during loading or on error, using a deferred render strategy.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty file with no content.",
  "frontend/src/components/SplashScreen.tsx": "Renders a full-screen Arabic/English splash screen with an owl image, project title, and an animated 'Enter' button that triggers a fade-out transition before calling the `onEnter` callback.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "Displays a static, non-interactive 3D map of Al Buraimi Governorate using React Three Fiber, loading an official map texture onto a flat plane with realistic lighting.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "Shows a static map image of Al Buraimi, loading it from blob storage if an active map reference exists or falling back to a local asset; admin users can upload a new map image.",
  "frontend/src/components/StatisticsPage.tsx": "Displays bird documentation statistics including total bird/location counts as summary cards, a Recharts bar chart of sightings per species, and a detailed data table.",
  "frontend/src/components/TeamDataTable.tsx": "Renders a static team roster UI showing hardcoded lists of project followers, members, the project manager, and the designer in styled Arabic cards.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and exposing status flags to consumers.",
  "frontend/src/hooks/useMemoryOptimization.ts": "A React hook that integrates with the MemoryManager to monitor JS heap usage, trigger automatic recovery, clear session storage caches, and display toast notifications when memory thresholds are exceeded.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (useQuery/useMutation) for fetching and mutating bird data, map references, user profiles, and roles via an ICP actor, with cache invalidation and toast notifications.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines light/dark CSS custom properties for a desert-themed color palette, and includes styles for the splash screen, owl images, canvas transparency, and mobile responsiveness.",
  "frontend/src/lib/csvExport.ts": "Utility that converts an array of BirdData objects into a UTF-8 BOM CSV string with Arabic headers and triggers a browser file download with a timestamped filename.",
  "frontend/src/lib/excelExport.ts": "Utility similar to csvExport that exports bird data to an Excel-compatible CSV file using native browser APIs, with Arabic column headers and a UTF-8 BOM for proper Arabic text rendering.",
  "frontend/src/lib/memoryManager.ts": "A singleton MemoryManager class that periodically checks JS heap usage via the Performance API, fires warning/critical callbacks at configurable thresholds, and executes registered recovery callbacks with a minimum cooldown interval.",
  "frontend/src/lib/pdfExport.ts": "Utility that converts an array of BirdData into a printable Arabic HTML page and triggers the browser's print dialog for PDF export.",
  "frontend/src/lib/requiredAssets.ts": "Registers and validates required static asset paths (owl hero image and logo) at module load time, throwing errors if any path is missing.",
  "frontend/src/lib/webglDetector.ts": "Detects WebGL support and mobile device status, and provides helpers for normalizing and comparing bird names.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BirdDataPage.tsx": "Page component that displays the BirdDataTable with a header and navigation buttons to return to the home page.",
  "frontend/src/pages/HomePage.tsx": "Home page that shows a splash screen on first visit, then renders a hero section, navigation cards, a static map, and a team data table.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, border radii, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata (version 41) tracking the app summary, architectural notes, known issues, and existing feature list for the Al Buraimi owl distribution tracker.",
  "unknown.txt": "Empty file with no content."
}