{
  "backend/main.mo": "Main Motoko actor for the bird atlas app, defining data types (BirdData, TeamMember, etc.) and providing CRUD operations for bird records, user profiles, team members, contact data, and access control using OrderedMap collections and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting implemented features, primarily the restoration of admin-only action buttons in BirdDataTable.tsx and BirdGallery.tsx, with associated file paths, component dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short human-readable summaries describing each component's purpose, key behaviors, and notable implementation details for build planning reference.",
  "frontend/index.html": "Root HTML entry point for the React app, configured for Arabic RTL with an owl favicon, viewport meta tag, and a single root div that loads the Vite/React module bundle.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with lazy-loaded routes for home, /data, /gallery, /bird/:name, /map, /eagle-owl, /statistics, /image-view, and /permissions, all wrapped in a QueryClientProvider and shared MainHeader layout.",
  "frontend/src/components/AllLocationsMap.tsx": "Interactive bird-locations map component that dynamically loads Leaflet.js via CDN, renders markers for all bird sighting coordinates fetched via useGetAllLocationsWithNames, and supports per-bird filtering with coordinate validation.",
  "frontend/src/components/BirdDataTable.tsx": "A React table component for displaying, searching, editing, adding, and deleting bird records, with admin-only controls gated by Internet Identity authentication and CSV export support.",
  "frontend/src/components/BirdDetailsPage.tsx": "A detail page component that fetches and displays full information for a single bird by name, including names, description, images, and audio player, with Arabic RTL layout.",
  "frontend/src/components/BirdGallery.tsx": "A gallery component that lists all birds with their images fetched from blob storage, and provides admin modals for adding new birds with image and audio uploads.",
  "frontend/src/components/BirdSelector.tsx": "A simple dropdown selector component for choosing a bird by name from a provided list, with a loading skeleton state.",
  "frontend/src/components/DeferredComponent.tsx": "A utility wrapper component that delays rendering of its children by a priority-based timeout to reduce initial memory load, showing a placeholder or spinner in the meantime.",
  "frontend/src/components/DesertOwlScene.tsx": "A scene component that detects WebGL support and renders a hero image of a desert owl with a gradient overlay, falling back to a static image to avoid memory issues.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "An empty file with no content.",
  "frontend/src/components/EagleOwlPage.tsx": "A page component dedicated to the Eagle Owl species that filters bird data and locations by owl-related keywords and displays stats, a hero section, and a list of matching birds and sighting locations.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class component that catches rendering errors, displays an Arabic error UI with retry options, and auto-retries once after 3 seconds.",
  "frontend/src/components/ExcelUploader.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "A top-level React error boundary that catches unhandled errors app-wide and shows an Arabic fallback UI with a full-page reload button that clears storage.",
  "frontend/src/components/HamburgerMenu.tsx": "A dropdown hamburger navigation menu with seven Arabic-labeled routes, closing on outside click or Escape key, built with Lucide icons and TanStack Router.",
  "frontend/src/components/ImageViewPage.tsx": "A full-screen image viewer page that reads an image URL from history state and provides zoom, rotation, and reset controls.",
  "frontend/src/components/Interactive3DMap.tsx": "A React Three Fiber 3D map component for Al-Buraimi that detects WebGL support and falls back to a static 2D image on unsupported devices.",
  "frontend/src/components/Interactive3DOwl.tsx": "A React Three Fiber 3D owl sprite component using a transparent PNG texture, with a plain image fallback when WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "A paginated gallery grid component that progressively loads items in batches and auto-loads more on scroll to prevent memory overflow.",
  "frontend/src/components/LazyMapComponent.tsx": "A progressive loading wrapper for map components that shows an animated Arabic placeholder while deferring map initialization using DeferredComponent with a configurable delay.",
  "frontend/src/components/MainHeader.tsx": "The main sticky header component with logo, desktop navigation links, authentication (Internet Identity login/logout), refresh button, and admin-only permissions link.",
  "frontend/src/components/MapView.tsx": "A Leaflet-based map component that dynamically loads the library, renders bird location markers with image popups, and filters out invalid coordinates.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "A temporary notification banner that appears after a memory-recovery page reload, reading a sessionStorage flag and auto-dismissing with a 5-second countdown.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Displays the official Al Buraimi Governorate map from Oman's National Survey Authority inside a responsive, lazily-loaded iframe.",
  "frontend/src/components/OwlDataTable.tsx": "Empty file with no content.",
  "frontend/src/components/OwlGallery.tsx": "An audio player component for a named bird that fetches and plays its associated audio file, showing play/pause controls or a fallback message if no audio is available.",
  "frontend/src/components/OwlImage.tsx": "Empty file with no content.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty file with no content.",
  "frontend/src/components/PermissionManagement.tsx": "An admin-only page for assigning user roles via Internet Identity, with access guards for unauthenticated users and non-admins, and a form to assign roles by principal ID.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "A safe wrapper that dynamically imports the Interactive3DOwl component with error handling, showing a static owl image as a placeholder during loading or on failure.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty file with no content.",
  "frontend/src/components/SplashScreen.tsx": "Renders a full-screen Arabic/English splash screen with an owl image, project title, and an animated 'Enter' button that triggers a fade-out transition before calling the `onEnter` callback.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "Displays a static, non-interactive 3D map of Al Buraimi Governorate using React Three Fiber, loading an official map texture onto a flat plane with realistic lighting.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "Shows a static map image of Al Buraimi, loading it from blob storage if an active map reference exists or falling back to a local asset; admin users can upload a new map image.",
  "frontend/src/components/StatisticsPage.tsx": "Displays bird observation statistics including summary cards for total bird species, locations, and audio files, plus a Recharts bar chart and data table of per-bird location counts.",
  "frontend/src/components/TeamDataTable.tsx": "Renders a static team roster UI showing hardcoded lists of project followers, members, a project manager, and a designer in Arabic.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage ICP AuthClient lifecycle, login/logout, and identity persistence with delegation validity checks.",
  "frontend/src/hooks/useMemoryOptimization.ts": "React hook that monitors JS heap memory usage at regular intervals, shows a warning notification at 50% usage, and triggers a page reload with session cache cleanup at 65% usage.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for fetching and mutating bird data, locations, user profiles, and roles, with toast notifications on mutation results.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/component/utility layers, CSS custom properties for a desert-themed light/dark color scheme, and styles for splash screen, image view, and site manager UI elements.",
  "frontend/src/lib/csvExport.ts": "Utility that converts an array of BirdData objects into a UTF-8 BOM CSV string with Arabic headers and triggers a browser file download with a timestamped filename.",
  "frontend/src/lib/excelExport.ts": "Utility that exports bird data to an Excel-compatible CSV file using native browser APIs, with Arabic column headers and UTF-8 BOM encoding for proper Arabic text display.",
  "frontend/src/lib/memoryManager.ts": "Singleton-style class that periodically checks JS heap memory stats, fires warning/critical callbacks at configurable thresholds (50%/65%), and triggers automatic recovery via registered callbacks and page reload.",
  "frontend/src/lib/pdfExport.ts": "Utility that converts an array of BirdData objects into a styled Arabic RTL HTML page and opens it in a new window to trigger the browser's print/PDF dialog.",
  "frontend/src/lib/requiredAssets.ts": "Registers and validates required static asset paths (owl hero image and logo) at module load time, throwing errors for missing paths and exporting a typed lookup helper.",
  "frontend/src/lib/webglDetector.ts": "Detects WebGL 1/2 support and mobile device status to decide whether to use a canvas fallback; also exports utility functions for normalizing and comparing bird names.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BirdDataPage.tsx": "Page component that renders the BirdDataTable with a header and navigation links back to the home page.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a splash screen, hero section with clickable owl audio, navigation cards to app sections, a drag-and-drop custom map image uploader, and a team data table.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, border radii, box shadows, accordion keyframes, and plugins (typography, container-queries, animate).",
  "project_state.json": "Project state metadata (version 95) tracking the app's summary, architectural notes, known deployment issues, and a list of existing feature IDs for the Al Buraimi bird distribution tracker.",
  "unknown.txt": "Empty file with no content."
}