{
  "backend/main.mo": "Main Motoko actor defining data types (BirdData, TeamMember, UserProfile, etc.) and backend logic for a bird survey app, including CRUD operations, access control, blob storage, and map management for the Al-Buraimi governorate owl survey project.",
  "feature_evidence.json": "Feature evidence report documenting a single completed feature: changing the main page title text in HomePage.tsx from 'طيور محافظة البريمي' to 'مشروع المسح الميداني لطائر البوم بمحافظة البريمي'.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing the purpose and key implementation details of each component, page, hook, and style file in the project.",
  "frontend/index.html": "Root HTML entry point for the React app, configured for Arabic RTL layout with an owl image favicon and metadata describing the Al-Buraimi owl distribution atlas.",
  "frontend/src/App.tsx": "Main React application file that sets up TanStack Router with lazy-loaded routes (home, data, gallery, bird details, map, eagle-owl, statistics, image-view, permissions) and wraps everything in a QueryClientProvider with error boundaries.",
  "frontend/src/components/AllLocationsMap.tsx": "Interactive Leaflet map component that dynamically loads Leaflet via CDN, displays bird location markers from the backend, and supports filtering by bird name with coordinate validation.",
  "frontend/src/components/BirdDataTable.tsx": "Admin-gated bird data table component with search, CSV export, inline row editing, and an add-new-bird form that persists data via the saveBirdData mutation and supports deletion via deleteDeleteBirdById.",
  "frontend/src/components/BirdDetailsPage.tsx": "Displays a detailed view of a single bird including its names, description, images, and audio file, fetched by name from the route params using React Query and blob storage hooks.",
  "frontend/src/components/BirdGallery.tsx": "Renders a gallery of all birds with support for viewing images in a modal and adding new birds (with image/audio uploads) via an authenticated modal form.",
  "frontend/src/components/BirdSelector.tsx": "A dropdown select component for choosing a bird by name from a provided list, with a loading skeleton state.",
  "frontend/src/components/DeferredComponent.tsx": "A wrapper component that delays rendering of its children by a priority-based timeout to reduce initial memory load, showing a placeholder or spinner in the meantime.",
  "frontend/src/components/DesertOwlScene.tsx": "Renders a hero scene for the desert owl, detecting WebGL support but always falling back to a static image to avoid memory issues during build.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "Empty file with no content.",
  "frontend/src/components/EagleOwlPage.tsx": "Displays a dedicated page for eagle owl (Bubo bubo) data, filtering all bird and location records by owl-related keywords and showing stats and lists.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class error boundary that catches rendering errors, auto-retries once after 3 seconds, and shows a user-friendly Arabic error UI with manual retry and home navigation options.",
  "frontend/src/components/ExcelUploader.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "A top-level React class error boundary that catches unhandled errors app-wide and displays a full-page Arabic error screen with a reload button that clears session storage.",
  "frontend/src/components/HamburgerMenu.tsx": "A responsive hamburger menu component that renders a dropdown navigation list with Arabic labels and icons, closing on outside clicks or Escape key press.",
  "frontend/src/components/ImageViewPage.tsx": "A full-screen image viewer page that supports zoom, rotation, and reset controls, loading the image URL from browser history state.",
  "frontend/src/components/Interactive3DMap.tsx": "A 3D map component using React Three Fiber that renders a textured plane of Al-Buraimi with orbit controls, automatically falling back to a static 2D image when WebGL is unsupported or on mobile.",
  "frontend/src/components/Interactive3DOwl.tsx": "A 3D owl sprite component using React Three Fiber with a transparent texture, falling back to a plain image tag when WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "A paginated gallery grid component that progressively loads items in batches, auto-loading more on scroll and showing a load-more button when additional items remain.",
  "frontend/src/components/LazyMapComponent.tsx": "A deferred loading wrapper for map components that shows an animated placeholder until the map is ready to render, using a configurable delay.",
  "frontend/src/components/MainHeader.tsx": "The sticky site header with logo, desktop navigation links, Internet Identity login/logout, a refresh button, and a hamburger menu for mobile, conditionally showing an admin permissions link.",
  "frontend/src/components/MapView.tsx": "Renders an interactive Leaflet map showing bird sighting locations with markers and image popups, dynamically loading Leaflet from CDN and filtering out invalid coordinates.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "Displays a temporary Arabic notification banner with a countdown when a memory recovery reload is detected via sessionStorage.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Embeds the official Al Buraimi Governorate map from the Oman National Survey Authority website in a responsive iframe.",
  "frontend/src/components/OwlDataTable.tsx": "Empty file with no content.",
  "frontend/src/components/OwlGallery.tsx": "Provides an audio player UI for a bird's sound file, fetching the audio path and URL via hooks and toggling play/pause state.",
  "frontend/src/components/OwlImage.tsx": "Empty file with no content.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty file with no content.",
  "frontend/src/components/PermissionManagement.tsx": "Admin-only page for assigning user roles by principal ID, with authentication and authorization checks before rendering the role assignment form.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "Lazily loads the Interactive3DOwl component with a static image placeholder fallback, handling load errors and a deferred rendering strategy to reduce memory pressure.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty file with no content.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen animated splash screen displaying the app title, an owl image, and an enter button with a fade-out transition before revealing the main app.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "Renders a static, non-interactive 3D map of Al Buraimi Governorate using React Three Fiber, displaying a textured plane with realistic lighting. Camera and orbit controls are fixed to prevent user interaction.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "Displays a static map image of Al Buraimi, loading it from blob storage if an active map reference exists or falling back to a local asset. Admin users can upload a new map image via a file input.",
  "frontend/src/components/StatisticsPage.tsx": "Shows bird observation statistics including total bird species, observation locations, and audio file counts, along with a bar chart and data table powered by Recharts and backend query hooks.",
  "frontend/src/components/TeamDataTable.tsx": "Renders a static display of project team members organized into followers, members, project manager, and designer sections using hardcoded Arabic names.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, login status, and control functions to child components.",
  "frontend/src/hooks/useMemoryOptimization.ts": "Monitors browser JS heap memory usage on an interval and triggers a page reload with session cache cleanup when usage exceeds a critical threshold, also exposing warning notifications.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating bird data, user profiles, and map references via an ICP actor, with toast notifications on mutations.",
  "frontend/src/index.css": "Global CSS file setting up Tailwind, a desert-themed light/dark color palette via CSS variables, RTL Arabic typography, splash screen styles, and various UI animations.",
  "frontend/src/lib/csvExport.ts": "Utility that converts BirdData arrays to UTF-8 BOM CSV strings with Arabic headers and triggers a browser file download.",
  "frontend/src/lib/excelExport.ts": "Exports BirdData arrays to an Excel-compatible CSV file with Arabic headers using native browser APIs and a UTF-8 BOM.",
  "frontend/src/lib/memoryManager.ts": "Implements a singleton MemoryManager class that monitors JS heap usage at configurable intervals and triggers registered recovery callbacks when warning or critical thresholds are exceeded.",
  "frontend/src/lib/pdfExport.ts": "Generates a printable Arabic HTML table from BirdData and opens it in a new browser window to trigger the native print/PDF dialog.",
  "frontend/src/lib/requiredAssets.ts": "Registers and validates required static asset paths at module load time, exporting a typed REQUIRED_ASSETS map and a helper getter.",
  "frontend/src/lib/webglDetector.ts": "Utility module that detects WebGL support (versions 1 and 2) and mobile device status, providing helper functions to determine if a fallback should be used. Also includes bird name normalization and comparison utilities.",
  "frontend/src/main.tsx": "React app entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BirdDataPage.tsx": "Page component that displays a bird data table with navigation links back to the home page, rendered in RTL layout.",
  "frontend/src/pages/HomePage.tsx": "Main home page featuring a splash screen, navigation cards to app sections, an interactive map with drag-and-drop image upload, and an owl sound effect on click.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, border radius, box shadows, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state tracking file recording version history, known issues, architectural notes, and existing features for a bird distribution tracker app targeting Al Buraimi Governorate.",
  "unknown.txt": "Empty file with no content."
}