{
  "backend/main.mo": "Main Motoko actor for the owl distribution atlas app, defining data types (BirdData, TeamMember, etc.) and providing CRUD operations for bird records, user profiles, team members, contact data, and access control using blob storage and role-based authorization.",
  "feature_evidence.json": "Feature evidence report documenting a single high-confidence feature: reverting the entire project (backend and frontend) to Draft Version 510, listing all affected files and components.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing the purpose and key implementation details of each component, hook, and utility in the project.",
  "frontend/index.html": "Root HTML entry point for the React app, configured for Arabic RTL layout with the owl atlas title, favicon, and a mount point for the React root.",
  "frontend/src/App.tsx": "Main React application file that sets up TanStack Router with all page routes (home, gallery, bird details, map, eagle-owl, statistics, image-view, permissions) using lazy loading, error boundaries, and a catch-all redirect to home.",
  "frontend/src/components/AllLocationsMap.tsx": "Map page component that overlays clickable bird location pins on a static Al Buraimi map image, showing a detail panel for the selected bird with image thumbnail and coordinates.",
  "frontend/src/components/BirdDataTable.tsx": "Admin-facing bird data table with search, add, edit, delete, and Excel/PDF export functionality, gated behind role-based access control using the caller's principal and admin status.",
  "frontend/src/components/BirdDetailsPage.tsx": "Displays detailed information about a single bird including an image carousel, audio player, and metadata fetched by bird name from URL params. Supports Arabic RTL layout with navigation back to home.",
  "frontend/src/components/BirdGallery.tsx": "Renders a searchable, expandable grid gallery of all birds with images, supporting filtering by Arabic/English/scientific name. Uses RTL layout and navigates to bird detail pages.",
  "frontend/src/components/BirdSelector.tsx": "A dropdown select component for choosing a bird by name from a list, with a loading skeleton state and RTL Arabic placeholder text.",
  "frontend/src/components/DeferredComponent.tsx": "A wrapper component that delays rendering of children based on priority levels to reduce initial memory load, showing a spinner or static placeholder in the meantime.",
  "frontend/src/components/DesertOwlScene.tsx": "Detects WebGL support and renders a static hero image of a desert owl scene as a fallback, with a loading spinner while detection runs.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "Empty file with no content.",
  "frontend/src/components/EagleOwlPage.tsx": "Displays a dedicated page for Eagle Owl (Bubo bubo) data, showing filtered bird records and observation locations matching owl-related keywords, with stats cards and a description section.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches rendering errors, displays an Arabic error UI with retry and home navigation buttons, and auto-retries once after 3 seconds.",
  "frontend/src/components/ExcelUploader.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "A React class-based error boundary that catches unhandled errors app-wide and displays a friendly Arabic error message with a reload button instead of a white screen.",
  "frontend/src/components/ImageViewPage.tsx": "A full-screen image viewer page with zoom, rotation, and reset controls, retrieving the image URL from browser history state and providing navigation back to the home route.",
  "frontend/src/components/Interactive3DMap.tsx": "Renders an interactive 3D map of Al-Buraimi using React Three Fiber with OrbitControls, automatically falling back to a static 2D image when WebGL is unsupported or on mobile.",
  "frontend/src/components/Interactive3DOwl.tsx": "Renders a 3D owl sprite using React Three Fiber with a transparent texture, falling back to a plain image tag when WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "A paginated gallery grid component that progressively loads items in batches and auto-loads more on scroll to prevent memory overflow.",
  "frontend/src/components/LazyMapComponent.tsx": "A deferred loading wrapper for map components that shows an animated placeholder until the map is ready, using a DeferredComponent utility for delayed initialization.",
  "frontend/src/components/MainHeader.tsx": "The sticky site header with Arabic navigation links, Internet Identity login/logout, a data refresh button, and an admin-only permissions link based on the user's principal.",
  "frontend/src/components/MapView.tsx": "Renders an interactive Leaflet map showing bird sighting locations with markers and image popups, dynamically loading Leaflet from CDN and filtering invalid coordinates.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "Displays a fixed notification banner with a countdown timer informing the user that the UI was reloaded to recover from a memory issue.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Embeds the official Al Buraimi Governorate map from Oman's National Survey Authority website in a responsive iframe.",
  "frontend/src/components/OwlDataTable.tsx": "Empty file with no content.",
  "frontend/src/components/OwlGallery.tsx": "Displays an audio player for a bird's sound file, fetching the audio URL from storage and providing play/pause controls.",
  "frontend/src/components/OwlImage.tsx": "Empty file with no content.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty file with no content.",
  "frontend/src/components/PermissionManagement.tsx": "Admin-only page for assigning user roles by principal ID, with access guards for unauthenticated users and non-admins.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "Lazily loads a 3D owl component with a static image placeholder fallback, handling load errors and deferred rendering to reduce memory pressure.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty file with no content.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen splash screen with an owl image, app title, and an enter button that triggers a fade-out transition before revealing the main app.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "Renders a static, non-interactive 3D map of Al Buraimi Governorate using React Three Fiber, displaying a textured flat plane with realistic lighting. Camera and orbit controls are fixed to prevent user interaction.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "Displays a static image map of Al Buraimi, loading it from blob storage if an active map reference exists or falling back to a local asset. Admin users can upload a new map image via a file input.",
  "frontend/src/components/StatisticsPage.tsx": "Shows bird observation statistics including total bird and location counts as summary cards, a bar chart of observation sites per species, and a detailed data table. Data is fetched via custom query hooks.",
  "frontend/src/components/TeamDataTable.tsx": "Renders a static display of project team members organized into followers, members, project manager, and designer sections using hardcoded Arabic names.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, initializing it with the user's Internet Identity or anonymously if unauthenticated. Invalidates and refetches dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, status flags, and login/clear functions to child components.",
  "frontend/src/hooks/useMemoryOptimization.ts": "Monitors browser memory usage via a singleton MemoryManager, triggering warnings, critical alerts, and auto-recovery actions with optional toast notifications. Exposes memory stats, recovery state, and a manual force-recovery callback.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating bird data, map references, and user profiles via an ICP actor, with toast notifications for mutations.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, defines light/dark CSS custom properties for a desert wildlife theme, and includes styles for splash screen, RTL Arabic layout, and various UI components.",
  "frontend/src/lib/csvExport.ts": "Utility that converts BirdData arrays to UTF-8 BOM CSV strings with Arabic headers and triggers a browser file download.",
  "frontend/src/lib/excelExport.ts": "Exports BirdData arrays to an Excel-compatible CSV file with Arabic headers using native browser APIs and a UTF-8 BOM.",
  "frontend/src/lib/memoryManager.ts": "Implements a MemoryManager class that periodically monitors JS heap usage, triggers configurable warning/critical callbacks, and runs registered recovery callbacks when memory thresholds are exceeded.",
  "frontend/src/lib/pdfExport.ts": "Generates a printable Arabic HTML table from BirdData and opens it in a new browser window to trigger the native print/PDF dialog.",
  "frontend/src/lib/requiredAssets.ts": "Registers and validates required static asset paths at module load time, exporting a typed REQUIRED_ASSETS map and a helper to retrieve paths with runtime checks.",
  "frontend/src/lib/webglDetector.ts": "Provides utilities to detect WebGL support (versions 1 and 2), identify mobile devices, and normalize/compare bird names for consistent matching.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/HomePage.tsx": "Home page component that shows a splash screen on first visit, then renders a hero section and navigation cards linking to gallery, map, eagle-owl, and statistics pages.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, border radii, box shadows, accordion animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state metadata (version 21) for a bird distribution tracker app, documenting known regressions across deployment versions and a pending request to revert to version 510.",
  "unknown.txt": "Empty file with no content."
}