{
  "backend/main.mo": "Main Motoko actor for the bird atlas app, defining data types (BirdData, TeamMember, etc.) and providing CRUD operations for bird records, user profiles, team members, contact data, and access control using blob storage and ordered maps.",
  "feature_evidence.json": "Feature evidence report documenting a single completed feature: removing the static map background image from AllLocationsMap.tsx without altering any other functionality.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, used as build planning reference documentation.",
  "frontend/index.html": "Root HTML entry point for the React app, configured for Arabic RTL layout with the owl atlas title and linking to the main TSX entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router with lazy-loaded routes for all pages (home, data, gallery, bird details, map, eagle-owl, statistics, image-view, permissions) wrapped in a QueryClientProvider and shared RootLayout with header.",
  "frontend/src/components/AllLocationsMap.tsx": "Bird locations map component that renders coordinate pins over a container div (no static background image), with bird name filtering, show/hide toggle, and a popup on pin click using RTL Arabic layout.",
  "frontend/src/components/BirdDataTable.tsx": "Admin data table for managing bird records with search, inline editing, add/delete/save-all actions, and CSV export, gated by async admin/modify permission checks.",
  "frontend/src/components/BirdDetailsPage.tsx": "Displays a detailed view of a single bird, showing its names, description, images, and audio file, fetched by name from the URL parameter.",
  "frontend/src/components/BirdGallery.tsx": "Main gallery component for browsing, searching, adding, editing, and deleting bird records, including image upload support and authentication checks.",
  "frontend/src/components/BirdSelector.tsx": "A dropdown selector component that renders a list of bird names for the user to choose from, with a loading skeleton state.",
  "frontend/src/components/DeferredComponent.tsx": "A wrapper component that delays rendering of its children by a priority-based timeout to reduce initial memory load, showing a placeholder or spinner in the meantime.",
  "frontend/src/components/DesertOwlScene.tsx": "Renders a hero scene for the desert owl, detecting WebGL support but always falling back to a static image to avoid memory issues.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "Empty file with no content.",
  "frontend/src/components/EagleOwlPage.tsx": "Displays a dedicated page for eagle owl birds, filtering all bird and location data by owl-related keywords and showing stats and a bird list.",
  "frontend/src/components/ErrorBoundary.tsx": "A React error boundary that catches rendering errors, auto-retries once after 3 seconds, and shows a user-friendly error UI with a manual retry button.",
  "frontend/src/components/ExcelUploader.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "A top-level React error boundary that catches unhandled errors app-wide and displays a full-page Arabic error message with a page reload button.",
  "frontend/src/components/HamburgerMenu.tsx": "A responsive hamburger menu component that renders a dropdown navigation list with Arabic labels and icons, closing on outside clicks or Escape key.",
  "frontend/src/components/ImageViewPage.tsx": "A full-screen image viewer page that supports zoom, rotation, and reset controls, loading the image URL from browser history state.",
  "frontend/src/components/Interactive3DMap.tsx": "A 3D map component using React Three Fiber that renders a textured plane of Al-Buraimi with orbit controls, automatically falling back to a static 2D image when WebGL is unsupported or on mobile.",
  "frontend/src/components/Interactive3DOwl.tsx": "A 3D owl sprite component using React Three Fiber with a transparent texture, falling back to a plain image tag when WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "A paginated gallery grid component that progressively loads items in batches and auto-loads more on scroll to prevent memory overflow.",
  "frontend/src/components/LazyMapComponent.tsx": "A deferred loading wrapper for map components that shows an animated placeholder until the map is ready to render.",
  "frontend/src/components/MainHeader.tsx": "The sticky site header with logo, desktop navigation links, Internet Identity login/logout, a refresh button, and a hamburger menu for mobile.",
  "frontend/src/components/MapView.tsx": "Renders an interactive Leaflet map showing bird sighting locations with markers and image popups, dynamically loading Leaflet from CDN and filtering invalid coordinates.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "Displays a temporary Arabic notification banner with a countdown when a memory recovery reload is detected via sessionStorage.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Embeds the official Al Buraimi Governorate map from Oman's National Survey Authority in a responsive iframe.",
  "frontend/src/components/OwlDataTable.tsx": "Empty file with no content.",
  "frontend/src/components/OwlGallery.tsx": "Fetches and plays an audio file for a given bird species, showing play/pause controls or a placeholder if no audio is available.",
  "frontend/src/components/OwlImage.tsx": "Empty file with no content.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty file with no content.",
  "frontend/src/components/PermissionManagement.tsx": "Admin-only page for assigning user roles by principal ID, with authentication and authorization guards redirecting non-admins to the home page.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "Lazily loads an Interactive3DOwl component with a static image placeholder fallback, handling load errors and deferred rendering to reduce memory pressure.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty file with no content.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen animated splash screen displaying the app title, an owl image, and an enter button with a fade-out transition on dismissal.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "Renders a static, non-interactive 3D map of Al Buraimi Governorate using React Three Fiber, displaying a textured plane with realistic lighting. Camera and orbit controls are fixed to prevent user interaction.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "Displays a static map image of Al Buraimi, loading it from blob storage if an active map reference exists or falling back to a local asset. Admin users can upload a new map image via a file input.",
  "frontend/src/components/StatisticsPage.tsx": "Shows bird observation statistics including total bird species, observation locations, and audio file counts, with a bar chart of top birds by location count and a data table.",
  "frontend/src/components/TeamDataTable.tsx": "Renders a static display of project team members organized into followers, members, project manager, and designer roles using hardcoded Arabic names.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning an authenticated actor when an identity is present or an anonymous actor otherwise, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, login status, and control functions to child components.",
  "frontend/src/hooks/useMemoryOptimization.ts": "Monitors browser JS heap memory usage on an interval and triggers a page reload with session storage cleanup when memory exceeds a critical threshold, also exposing warning notifications and usage formatting.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating bird data, user profiles, and map references via an ICP actor, with toast notifications for mutations.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, defines light/dark CSS custom properties for a desert wildlife theme, and includes styles for splash screen, RTL layout, and various UI components.",
  "frontend/src/lib/csvExport.ts": "Utility that converts BirdData arrays to UTF-8 BOM CSV strings with Arabic headers and triggers a browser file download.",
  "frontend/src/lib/excelExport.ts": "Exports BirdData arrays to an Excel-compatible CSV file with Arabic headers using native browser APIs and a UTF-8 BOM.",
  "frontend/src/lib/memoryManager.ts": "Implements a MemoryManager class that periodically monitors JS heap usage and triggers registered recovery callbacks when configurable warning or critical thresholds are exceeded.",
  "frontend/src/lib/pdfExport.ts": "Generates a printable Arabic HTML table from BirdData and opens it in a new browser window to trigger the native print/PDF dialog.",
  "frontend/src/lib/requiredAssets.ts": "Registers and validates required static asset paths at module load time, exporting a typed REQUIRED_ASSETS map and a helper to retrieve paths with runtime checks.",
  "frontend/src/lib/webglDetector.ts": "Utility module that detects WebGL support (v1/v2) and mobile device status, recommending a fallback for mobile users. Also includes helper functions for normalizing and comparing bird names.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BirdDataPage.tsx": "Page component that renders the BirdDataTable with a header and navigation links back to the home page, laid out RTL in Arabic.",
  "frontend/src/pages/HomePage.tsx": "Home page component featuring a splash screen, hero section with an owl image, and a grid of navigation cards linking to gallery, data, map, statistics, and other sections.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, border radii, box shadows, accordion keyframes, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata (version 79) tracking the app's summary, architectural notes, known deployment issues, and a list of existing features for the Al Buraimi bird distribution tracker.",
  "unknown.txt": "Empty file with no content."
}