{
  "kind": "build_request",
  "title": "Remove static map image from AllLocationsMap page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-75",
      "text": "In frontend/src/components/AllLocationsMap.tsx only, remove the existing static map image (the base map background/image element currently displayed on the bird locations map page). Do not change any other aspect of the component — all bird filtering logic, show/hide toggle, pin rendering, return-to-home button, RTL orientation, styling, and all other functionality must remain exactly as they are. The user will upload the correct map image themselves. Do NOT modify any other file, component, page, route, or backend file.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "بدون ان تغير اي شيء في التطبيق قم بحذف الخريطة التي في خريطة مواقع الطيور لانها غير صحيحة ساقوم برفع الخريطة التي لدي"
        ]
      },
      "acceptanceCriteria": [
        "The static map image element is no longer rendered on the bird locations map page (AllLocationsMap.tsx).",
        "The map area appears empty or shows a neutral background placeholder where the map image was.",
        "All bird filtering controls (bird name list/dropdown, 'All' option, show/hide toggle) remain present and functional.",
        "Bird location pins still render in the correct positions when a bird or 'All' is selected.",
        "The 'Return to Home' button remains present and functional.",
        "RTL orientation, desert/amber styling, and all other UI elements are unchanged.",
        "No other file, component, page, route, or backend file is modified."
      ]
    }
  ],
  "constraints": [
    "Only frontend/src/components/AllLocationsMap.tsx may be modified.",
    "Do not change any logic, layout, styling, or functionality beyond removing the static map image element.",
    "Do not modify any other file, component, page, route, or backend file."
  ],
  "nonGoals": [
    "Uploading or adding a new map image (the user will do this themselves).",
    "Changing bird filtering logic, pin rendering, or any other map feature.",
    "Modifying any other component, page, route, or backend file."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}