{
  "kind": "build_request",
  "title": "Rebuild and redeploy without any code changes",
  "projectName": "Al Buraimi Owl Atlas",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-141",
      "text": "Rebuild and redeploy the current project state without making any code changes to any file. Ensure the backend (backend/main.mo) compiles and deploys correctly, and all frontend source files are bundled and served without errors. The deployment must restore the app to its last intended state including: the BirdDataTable with all five admin-only action buttons (إضافة, تعديل, حفظ, حذف, تحرير) visible and functional for authenticated admin users; the interactive AllLocationsMap with bird filtering and show/hide toggle; the BirdGallery with admin action buttons and image click modal; the HomePage with splash screen, hero section, navigation cards, map upload section, and team table; the HamburgerMenu with all navigation links; and all TanStack Router routes correctly registered (/data, /gallery, /map, /bird/:name, /eagle-owl, /statistics, /image-view, /permissions).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "لا حاول بدون ان تغير اي شيء في التطبيق"
        ]
      },
      "acceptanceCriteria": [
        "No source files are modified — only a clean rebuild and redeploy is performed",
        "Backend compiles and deploys without errors",
        "All frontend routes (/data, /gallery, /map, /bird/:name, /eagle-owl, /statistics, /image-view, /permissions) are accessible",
        "BirdDataTable renders with all five admin-only action buttons visible after admin login",
        "BirdGallery renders with admin action buttons and image-click modal",
        "AllLocationsMap renders with interactive Leaflet map, bird-name filter, and show/hide toggle",
        "HomePage renders with splash screen, hero section, navigation cards, map upload section, and team table",
        "HamburgerMenu renders with all navigation links"
      ]
    }
  ],
  "constraints": [
    "No code changes of any kind may be made to any file",
    "Only a clean rebuild and redeploy of the existing codebase is permitted"
  ],
  "nonGoals": [
    "Any code modifications, bug fixes, or feature additions",
    "Any refactoring or restructuring of existing files"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}