{
  "kind": "build_request",
  "title": "Replace 'Tropical' zone value with '40' in BirdDataTable",
  "projectName": "Al Buraimi Owl Atlas",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-119",
      "text": "In frontend/src/components/BirdDataTable.tsx only, update the 'Zone' (المنطقة) column so that any cell displaying the value 'Tropical' renders '40' instead. This change must apply to both the read-only display cells and the editable input fields in inline-edit mode. Do NOT change any other column definitions, layout, RTL orientation, horizontal scrolling behavior, color scheme, admin access control logic, data-fetching logic, font sizes, action buttons, or any other aspect of the component. Do NOT modify any other file, component, page, route, or backend file.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "استبد في جدول البيانات المنطقة استوائية الى 40 بدون ان تغير اي شيء اخر في الجدول"
        ]
      },
      "acceptanceCriteria": [
        "Any cell in the 'Zone' (المنطقة) column that previously displayed 'Tropical' now displays '40'.",
        "The substitution applies to read-only display cells in normal table view.",
        "The substitution applies to the editable input fields when a row is in inline-edit mode.",
        "No other column, row, styling, layout, or functionality of BirdDataTable.tsx is changed.",
        "No other file, component, page, route, or backend file is modified."
      ]
    }
  ],
  "constraints": [
    "Only frontend/src/components/BirdDataTable.tsx may be modified.",
    "No other file, component, page, route, or backend file may be changed.",
    "All existing column definitions, layout, RTL orientation, horizontal scrolling, color scheme, admin access control logic, data-fetching logic, font sizes, and action buttons must remain exactly as they are."
  ],
  "nonGoals": [
    "Changing the backend data model or stored zone values.",
    "Modifying any other column or field in the table.",
    "Altering any other component, page, or route."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}