{
  "kind": "build_request",
  "title": "Fix BirdGallery: show newly added birds and enable image/audio upload in edit dialog",
  "projectName": "Owl Atlas Al-Buraimi",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "After a new bird is added, the BirdGallery component must immediately display the newly added bird's card without requiring a full page reload. Ensure the React Query cache for the gallery list is invalidated (or refetched) upon successful bird creation so the new entry appears in the gallery grid.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "معرض الصور بعد اضافة طائر لا يظهر"
        ]
      },
      "acceptanceCriteria": [
        "When a new bird is added via the gallery's add dialog, the bird's card appears in the gallery immediately after the dialog closes.",
        "No full page reload is required to see the new bird in the gallery.",
        "The gallery list query is refetched/invalidated on successful bird creation."
      ]
    },
    {
      "id": "REQ-2",
      "text": "The edit button/option in BirdGallery must be visible and functional for each bird card. Currently the edit option does not appear. Ensure the edit dialog is rendered and the edit trigger (button/icon) is shown correctly for each card, respecting existing admin-check logic without altering it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "والتعديل لا بظهر"
        ]
      },
      "acceptanceCriteria": [
        "An edit button or icon is visible on each bird card in the gallery for users with admin access.",
        "Clicking the edit button opens the edit dialog pre-populated with the bird's current data.",
        "The edit option does not disappear or fail to render after adding a new bird."
      ]
    },
    {
      "id": "REQ-3",
      "text": "In the BirdGallery edit dialog, add file upload inputs that allow replacing the bird's image and/or audio file. The upload should store the new blob to the backend and update the bird record. This change must be scoped only to the edit dialog inside BirdGallery and must not affect any other part of the application.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "رفع صورة لتمكين تغير الصورة او الصوت بدون اي تغير في التطبيق فقط بمعرض الصور تضبيط خاصية التعديل"
        ]
      },
      "acceptanceCriteria": [
        "The edit dialog in BirdGallery contains a file input for uploading a new image (accepts common image formats: jpg, png, webp).",
        "The edit dialog in BirdGallery contains a file input for uploading a new audio file (accepts common audio formats: mp3, wav, ogg).",
        "When a new image or audio file is selected and the edit form is submitted, the blob is uploaded to the backend and the bird record is updated with the new media reference.",
        "If no new file is selected, the existing image/audio is preserved.",
        "No other components or pages in the application are modified.",
        "After a successful edit save, the gallery card reflects the updated image."
      ]
    }
  ],
  "constraints": [
    "Do not modify any component or page outside of BirdGallery (and the backend blob/bird update functions if needed for REQ-3).",
    "Do not alter admin-check logic or access control in any component.",
    "Do not change the overall app layout, routing, or any other feature.",
    "Immutable paths (useInternetIdentity, useActor, main.tsx, ui components) must not be edited."
  ],
  "nonGoals": [
    "Redesigning the gallery UI or card layout.",
    "Adding image/audio upload to the add-bird dialog (only edit dialog is in scope).",
    "Changing any other CRUD functionality in BirdDataTable or other components.",
    "Modifying the map, statistics, or any other page.",
    "Any backend schema migration unrelated to supporting media blob updates in the edit flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}