{
  "kind": "build_request",
  "title": "Fix Add/Edit/Save/Delete buttons in BirdDataTable without changing anything else",
  "projectName": "Al Buraimi Owl Atlas",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-51",
      "text": "Fix frontend/src/components/BirdDataTable.tsx so that the Add (إضافة), Edit (تعديل), Save (حفظ), and Delete (حذف) action buttons are visible and fully functional for authenticated admin users. The Add button must appear in the table toolbar/header area. Each data row must show an Edit button that switches the row into inline edit mode; in edit mode the Edit button is replaced by a Save button that commits the changes to the backend. Each row must also have a Delete button. All buttons must be styled using the existing desert/amber RTL Arabic theme already present in the file. All four actions must be restricted to authenticated admin users only using the same principal/role-check logic already in BirdDataTable.tsx. This change must be isolated exclusively to BirdDataTable.tsx — no other file, component, page, route, or backend file may be modified.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "اخبرتك لا تغير اي شيء فقط اضافة الان لا توجد ازرار اضافة حفظ حذف تحريرتعديل الرجاء الاضافة بدون اي تغيرات في التطبيق من فضلك"
        ]
      },
      "acceptanceCriteria": [
        "An 'إضافة' (Add) button is visible in the table toolbar/header area when the authenticated user is an admin.",
        "Clicking 'إضافة' inserts a new empty editable row into the table.",
        "Each existing data row displays a 'تعديل' (Edit) button when not in edit mode.",
        "Clicking 'تعديل' on a row switches that row into inline edit mode with editable fields.",
        "When a row is in edit mode, the 'تعديل' button is replaced by a 'حفظ' (Save) button.",
        "Clicking 'حفظ' commits the edited row data to the backend and exits edit mode.",
        "Each data row displays a 'حذف' (Delete) button that removes the record from the backend.",
        "All four buttons are hidden or disabled for unauthenticated users and non-admin users.",
        "Button styles use the existing desert/amber RTL Arabic theme already in BirdDataTable.tsx.",
        "No other file, component, page, route, or backend file is modified."
      ]
    }
  ],
  "constraints": [
    "Only frontend/src/components/BirdDataTable.tsx may be modified.",
    "Do not change any other component, page, route, hook, or backend file.",
    "Do not alter any existing functionality, layout, or styling outside of the CRUD buttons."
  ],
  "nonGoals": [
    "Modifying App.tsx, HomePage.tsx, BirdDataPage.tsx, or any other frontend file.",
    "Changes to backend/main.mo or backend/migration.mo.",
    "Altering navigation, routing, or any other UI section.",
    "Redesigning or restyling any part of the app other than the new action buttons."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}