{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Add/Edit/Save/Delete buttons in BirdDataTable without changing anything else",
  "requirements": [
    {
      "id": "REQ-51",
      "summary": "Fix frontend/src/components/BirdDataTable.tsx to make Add (إضافة), Edit (تعديل), Save (حفظ), and Delete (حذف) action buttons visible and fully functional for authenticated admin users using the existing desert/amber RTL Arabic theme and principal/role-check logic already present in the file",
      "acceptanceCriteria": [
        "An 'إضافة' (Add) button is visible in the table toolbar/header area when the authenticated user is an admin.",
        "Clicking 'إضافة' inserts a new empty editable row into the table.",
        "Each existing data row displays a 'تعديل' (Edit) button when not in edit mode.",
        "Clicking 'تعديل' on a row switches that row into inline edit mode with editable fields.",
        "When a row is in edit mode, the 'تعديل' button is replaced by a 'حفظ' (Save) button.",
        "Clicking 'حفظ' commits the edited row data to the backend and exits edit mode.",
        "Each data row displays a 'حذف' (Delete) button that removes the record from the backend.",
        "All four buttons are hidden or disabled for unauthenticated users and non-admin users.",
        "Button styles use the existing desert/amber RTL Arabic theme already in BirdDataTable.tsx.",
        "No other file, component, page, route, or backend file is modified."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BirdDataTable.tsx",
          "operation": "modify",
          "description": "Add visible and functional Add (إضافة), Edit (تعديل), Save (حفظ), and Delete (حذف) action buttons for authenticated admin users. The Add button must appear in the table toolbar/header area. Each data row must show an Edit button that switches the row into inline edit mode (with editable input fields); when in edit mode, the Edit button is replaced by a Save button that commits changes to the backend via existing mutations. Each row must also display a Delete button that removes the record. All buttons must use the existing desert/amber RTL Arabic theme (amber-600, hover:amber-700, disabled:opacity-50, rounded-lg, px-3, py-1.5) already present in BirdDataTable.tsx. All four actions must be restricted to authenticated admin users only using the existing isCallerAdmin check already in the file. Implement inline row editing state (track editing row ID, original data for cancel, edited field values). Wire the Add button to insert a new empty editable row at the top of the table. Wire the Edit button to toggle a row into edit mode with input fields for arabicName, scientificName, englishName, description, notes, and coordinate fields. Wire the Save button to call the existing saveBirdData or addOrUpdateBird mutation with the edited values and exit edit mode on success. Wire the Delete button to call the existing deleteBirdById mutation with confirmation. Ensure buttons are only visible when isAdmin is true. Do not modify any other part of the file including search, export, pagination, or existing table structure. Do not change any other component, page, route, or backend file."
        }
      ]
    }
  ]
}