{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix BirdGallery: show newly added birds and enable image/audio upload in edit dialog",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Invalidate gallery query cache after adding a new bird so it appears immediately without page reload",
      "acceptanceCriteria": [
        "When a new bird is added via the gallery's add dialog, the bird's card appears in the gallery immediately after the dialog closes.",
        "No full page reload is required to see the new bird in the gallery.",
        "The gallery list query is refetched/invalidated on successful bird creation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BirdGallery.tsx",
          "operation": "modify",
          "description": "In the handleAddBird function (within the add dialog's onSubmit), after the successful addBirdWithDetails mutation, call queryClient.invalidateQueries({ queryKey: ['getAllBirdDetails'] }) to refetch the bird list. This ensures the newly added bird appears in the gallery grid immediately without requiring a page reload."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the edit button is visible and functional for each bird card in the gallery",
      "acceptanceCriteria": [
        "An edit button or icon is visible on each bird card in the gallery for users with admin access.",
        "Clicking the edit button opens the edit dialog pre-populated with the bird's current data.",
        "The edit option does not disappear or fail to render after adding a new bird."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BirdGallery.tsx",
          "operation": "modify",
          "description": "Review the bird card rendering logic to ensure the edit button/icon is always rendered when isAdmin is true. Verify that the edit button's onClick handler correctly sets the selectedBirdForEdit state and opens the edit dialog. If the edit button is conditionally hidden or not wired, add or fix the button element with proper event handling. Ensure the edit dialog's open state is controlled by checking if selectedBirdForEdit is not null."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add file upload inputs to the edit dialog for replacing bird image and audio, storing blobs and updating the bird record",
      "acceptanceCriteria": [
        "The edit dialog in BirdGallery contains a file input for uploading a new image (accepts common image formats: jpg, png, webp).",
        "The edit dialog in BirdGallery contains a file input for uploading a new audio file (accepts common audio formats: mp3, wav, ogg).",
        "When a new image or audio file is selected and the edit form is submitted, the blob is uploaded to the backend and the bird record is updated with the new media reference.",
        "If no new file is selected, the existing image/audio is preserved.",
        "No other components or pages in the application are modified.",
        "After a successful edit save, the gallery card reflects the updated image."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BirdGallery.tsx",
          "operation": "modify",
          "description": "In the edit dialog form: (1) Add two useState hooks to track selected image and audio files (e.g., selectedImageFile and selectedAudioFile, both File | null). (2) Add a file input for image with accept=\"image/jpeg,image/png,image/webp\" and onChange handler that stores the selected file in selectedImageFile. (3) Add a file input for audio with accept=\"audio/mp3,audio/wav,audio/ogg\" and onChange handler that stores the selected file in selectedAudioFile. (4) In the edit dialog's onSubmit handler, before calling the saveBirdData mutation: if selectedImageFile exists, call uploadFile from useFileUpload (imported from '../blob-storage/FileStorage') to upload the image blob, then update the bird's mainImage field with the returned path; if selectedAudioFile exists, similarly upload it and update the bird's audioFile field with the returned path. (5) After successful mutation, call queryClient.invalidateQueries({ queryKey: ['getAllBirdDetails'] }) to refresh the gallery. (6) Reset selectedImageFile and selectedAudioFile to null when the dialog closes or after a successful save. Verify the blob-storage component's usage instructions before implementing the upload logic."
        }
      ]
    }
  ]
}