{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore all bird data and admin control buttons after v598 regression",
  "requirements": [
    {
      "id": "REQ-144",
      "summary": "Restore all five admin-only action buttons in BirdDataTable (إضافة, تعديل, حفظ, حذف, تحرير) for authenticated admin users, ensuring isAdmin check uses useState + useEffect pattern that triggers re-render after actor/identity resolves",
      "acceptanceCriteria": [
        "Authenticated admin user sees all five action buttons (إضافة, تعديل, حفظ, حذف, تحرير) in BirdDataTable",
        "Add button appears in the toolbar/header area and creates a new empty editable row",
        "Edit button on each row switches it into inline edit mode",
        "Save button replaces Edit when a row is in edit mode and commits changes to the backend",
        "Delete button on each row removes the record from the backend",
        "Update/Edit (تحرير) button on each row provides alternative update action",
        "Non-admin and unauthenticated users do not see any action buttons",
        "All existing column definitions, RTL orientation, horizontal scrolling, color scheme, and data-fetching logic are unchanged"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BirdDataTable.tsx",
          "operation": "modify",
          "description": "Restore all five admin-only action buttons (إضافة in toolbar, تعديل/حفظ/حذف/تحرير on each row) by implementing a useState + useEffect pattern for isAdmin that properly triggers re-render after the actor and identity resolve. Ensure the isAdmin state is initially false, then updated in useEffect when isCallerAdmin() query resolves successfully. Keep all existing column definitions, layout, RTL orientation, horizontal scrolling, color scheme, font sizes, and data-fetching logic exactly as they are. The Add button must insert a new empty editable row at the top of the table. The Edit button must switch the row into inline edit mode. The Save button must replace Edit when in edit mode and commit changes to the backend. The Delete button must remove the record from the backend. The Update/Edit (تحرير) button must provide alternative update action. Use the authorization component's isCallerAdmin backend capability via React Query to determine admin status. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-145",
      "summary": "Restore all admin-only action buttons in BirdGallery (إضافة, حفظ, حذف, تحرير, إضافة الصوت) for authenticated admin users, ensuring isAdmin check uses useState + useEffect pattern that triggers re-render after actor/identity resolves",
      "acceptanceCriteria": [
        "Authenticated admin user sees Add (إضافة), Save (حفظ), Delete (حذف), Update/Edit (تحرير), and Add Audio (إضافة الصوت) buttons in BirdGallery",
        "Add button opens a form/modal for uploading main image and sub-images for a new bird record",
        "Save button on each card commits pending edits to the backend",
        "Delete button on each card removes the record from the backend",
        "Update/Edit button on each card switches the entry into an editable state",
        "Add Audio button opens a file picker restricted to audio types and uploads the audio blob to the backend",
        "Non-admin and unauthenticated users do not see any action buttons",
        "Existing gallery search, card layout, image display, RTL orientation, data-fetching logic, and image-click modal are unchanged"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BirdGallery.tsx",
          "operation": "modify",
          "description": "Restore all admin-only action buttons (إضافة in toolbar, حفظ/حذف/تحرير/إضافة الصوت on each card) by implementing a useState + useEffect pattern for isAdmin that properly triggers re-render after the actor and identity resolve. Ensure the isAdmin state is initially false, then updated in useEffect when isCallerAdmin() query resolves successfully. Keep all existing gallery search, card layout, image display, RTL orientation, data-fetching logic, and image-click modal exactly as they are. The Add button must open a form/modal for uploading main image and sub-images for a new bird record. The Save button on each card must commit pending edits to the backend. The Delete button on each card must remove the record from the backend. The Update/Edit (تحرير) button on each card must switch the entry into an editable state. The Add Audio (إضافة الصوت) button on each card must open a file picker restricted to audio file types and upload the selected audio blob to the backend using the blob-storage component. Use the authorization component's isCallerAdmin backend capability via React Query to determine admin status. Verify the blob-storage component's usage instructions before implementing file uploads."
        }
      ]
    },
    {
      "id": "REQ-146",
      "summary": "Restore all bird data records displayed in BirdDataTable by fixing the data-fetching logic if broken by v598, ensuring the table correctly fetches and displays all bird records returned by the backend via React Query / useActor pattern",
      "acceptanceCriteria": [
        "All bird records stored in the backend are visible in the BirdDataTable on the data page",
        "Table renders all rows returned by the backend without deduplication or collapse",
        "Data loads correctly on first render without requiring page refresh",
        "No regression to existing table structure, columns, styling, or admin buttons"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BirdDataTable.tsx",
          "operation": "modify",
          "description": "Identify and fix any data-fetching logic issues introduced in v598 that prevent bird records from loading in the table. Ensure the component correctly uses the existing React Query hook (likely useGetAllBirdDetails or similar from useQueries.ts) with the useActor pattern to fetch all bird records from the backend. Verify the query is enabled only when the actor is available, that loading states are handled properly, and that all returned records are displayed without deduplication or filtering. Do not change column definitions, layout, RTL orientation, horizontal scrolling, color scheme, font sizes, admin guard logic, or action buttons. Only fix the data-fetching and rendering logic if it is broken."
        }
      ]
    }
  ]
}