{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore missing columns and upload functionality in BirdDataTable",
  "requirements": [
    {
      "id": "REQ-112",
      "summary": "Restore missing 'Northern Hemisphere' (النصف الشمالي), 'Latitude (°)' (خط العرض °), and 'Zone' (المنطقة) columns to BirdDataTable with full Add/Edit support",
      "acceptanceCriteria": [
        "The bird data table displays 'Northern Hemisphere' (النصف الشمالي), 'Latitude (°)' (خط العرض °), and 'Zone' (المنطقة) column headers",
        "Each data row renders the corresponding field values for these three columns",
        "The Add new row form includes input fields for Northern Hemisphere, Latitude (°), and Zone",
        "The inline Edit mode for each row includes editable input fields for Northern Hemisphere, Latitude (°), and Zone",
        "All existing columns, buttons, layout, RTL orientation, and functionality are unchanged",
        "No other file is modified"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BirdDataTable.tsx",
          "operation": "modify",
          "description": "Add the three missing column definitions ('Northern Hemisphere', 'Latitude (°)', 'Zone') to the table header in the correct position within the existing column structure. Add corresponding data cells that display the field values from each bird record. Add input fields for these three columns in both the Add new row form state and JSX, and in the inline Edit mode for existing rows. Ensure all input fields are properly wired to state management and included in save/update operations. Preserve all existing column definitions, RTL layout, horizontal scrolling, color scheme, admin access control, data-fetching logic, font sizes, action buttons, and all other functionality exactly as they are."
        }
      ]
    },
    {
      "id": "REQ-113",
      "summary": "Restore image and audio upload functionality in BirdGallery so uploads are immediately visible",
      "acceptanceCriteria": [
        "Uploading a main image and sub-images via the Add form causes the new bird card with those images to appear immediately in the gallery after save",
        "Uploading replacement images via the Update/Edit (تحرير) action persists the new images to the bird record and they are visible on the card",
        "Uploading an audio file via the Add Audio (إضافة الصوت) button associates the audio blob ID with the bird record and the audio is playable from the gallery card",
        "All existing gallery functionality (search, card layout, image-click modal, admin buttons) is unchanged",
        "No other file is modified"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BirdGallery.tsx",
          "operation": "modify",
          "description": "Use the blob-storage component to restore file upload functionality. For the Add form: import useFileUpload from '../blob-storage/FileStorage', convert uploaded image files to blobs via uploadFile, store the returned path values in the bird record's images array field, and ensure the backend save operation includes these paths so the new card appears immediately in the gallery. For the Update/Edit (تحرير) action: enable image replacement by uploading new images as blobs, updating the bird record with the new paths, and ensuring the persisted changes are reflected on the card. For the Add Audio (إضافة الصوت) button: upload the audio file as a blob, store the returned path in the bird record's audio field, and ensure the audio is immediately accessible from the gallery card. Verify the blob-storage component's usage instructions before implementing. Preserve all existing gallery functionality including search, card layout, RTL orientation, image-click modal, data-fetching logic, and all other admin buttons exactly as they are."
        }
      ]
    }
  ]
}