{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove static map image from AllLocationsMap page",
  "requirements": [
    {
      "id": "REQ-75",
      "summary": "Remove the static map image element from AllLocationsMap.tsx while preserving all other functionality including bird filtering, pin rendering, show/hide toggle, return-to-home button, RTL orientation, and styling",
      "acceptanceCriteria": [
        "The static map image element is no longer rendered on the bird locations map page (AllLocationsMap.tsx).",
        "The map area appears empty or shows a neutral background placeholder where the map image was.",
        "All bird filtering controls (bird name list/dropdown, 'All' option, show/hide toggle) remain present and functional.",
        "Bird location pins still render in the correct positions when a bird or 'All' is selected.",
        "The 'Return to Home' button remains present and functional.",
        "RTL orientation, desert/amber styling, and all other UI elements are unchanged.",
        "No other file, component, page, route, or backend file is modified."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AllLocationsMap.tsx",
          "operation": "modify",
          "description": "Remove the static map image element (img tag or image component) that serves as the base map background. Locate the image element displaying the map and remove it from the JSX structure. Ensure the container for bird location pins remains intact with its existing dimensions and styling so pins continue to render at their correct coordinate positions. All other functionality including bird filtering dropdown, 'All birds' option, show/hide pins toggle, bird name display, return-to-home navigation button, RTL text direction, and desert/amber color scheme must remain completely unchanged. The map area should display a neutral or empty background where the image was previously shown."
        }
      ]
    }
  ]
}