{
  "backend/main.mo": "Main Motoko actor implementing bird location tracking system with access control, user profiles, blob storage for files, and team management. Provides CRUD operations for bird data (with coordinates, audio, images), location tracking, file references, and team member records.",
  "feature_evidence.json": "Feature evidence report documenting the \"Add Data\" button restoration feature in BirdDataTable.tsx for creating new bird records with name, coordinates, images, audio files, and description fields.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend components including map pages with WebGL detection, bird gallery with CRUD operations, 3D interactive components, team data display, and React Query hooks for backend integration.",
  "frontend/index.html": "HTML entry point with Arabic language attribute and viewport configuration, loading the React application from main.tsx with title \"مواقع انتشار البوم بمحافظة البريمي\" (Owl Distribution Locations in Al Buraimi Governorate).",
  "frontend/src/App.tsx": "Main React application component with Arabic RTL interface, lazy-loaded routes using TanStack Router, comprehensive error boundaries, memory optimization, splash screen, and forced data synchronization on load with enhanced loading states and fallback handling.",
  "frontend/src/components/AllLocationsMap.tsx": "Interactive map component displaying all bird locations in Al Buraimi Governorate using Leaflet, with coordinate validation, popup details panels showing bird data with images and audio playback, filtering, search functionality, and export options.",
  "frontend/src/components/BirdDataTable.tsx": "Bird data table component with inline editing, Add Data dialog for creating new bird records with full details (names, coordinates, images, audio, description, notes), delete confirmation, Excel/PDF export, and authorization checks for modify operations.",
  "frontend/src/components/BirdDetailsPage.tsx": "Displays detailed bird information including images, audio, description, notes, and locations with edit/upload capabilities. Manages audio playback, image gallery navigation, and file uploads for bird media.",
  "frontend/src/components/BirdGallery.tsx": "Gallery view component for browsing all birds with search, filtering, and CRUD operations. Supports editing bird details, uploading images/audio, deleting birds, and exporting data to Excel/PDF.",
  "frontend/src/components/BirdSelector.tsx": "Simple dropdown selector component for choosing a bird from a list of bird names with loading state support.",
  "frontend/src/components/DeferredComponent.tsx": "Wrapper component that delays rendering of heavy components to reduce initial memory load with configurable priority levels and static placeholders.",
  "frontend/src/components/DesertOwlScene.tsx": "Hero scene component for desert owl display that detects WebGL support and falls back to static image to avoid memory issues during build.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "Empty file with no content.",
  "frontend/src/components/EagleOwlPage.tsx": "Specialized page for displaying eagle owl species with interactive map showing locations in Al Buraimi Governorate, species filtering, and coordinate validation.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors, displays user-friendly error messages in Arabic, and provides automatic retry with manual fallback options.",
  "frontend/src/components/ExcelUploader.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "React error boundary component that catches unhandled errors at the root level and displays a friendly Arabic error message with reload functionality, preventing white screen crashes.",
  "frontend/src/components/ImageViewPage.tsx": "Full-screen image viewer component with zoom, rotation, and navigation controls for browsing through multiple images in a gallery.",
  "frontend/src/components/Interactive3DMap.tsx": "3D interactive map component using Three.js/React Three Fiber that displays Al-Buraimi map with WebGL detection and automatic fallback to 2D static map on mobile or unsupported devices.",
  "frontend/src/components/Interactive3DOwl.tsx": "3D owl sprite component using Three.js with transparent texture rendering, orbit controls, and fallback to static image when WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "Progressive loading gallery component that renders items in batches with infinite scroll to prevent memory overflow when displaying large image collections.",
  "frontend/src/components/LazyMapComponent.tsx": "Wrapper component that defers map initialization with a loading placeholder to prevent memory spikes during initial page load.",
  "frontend/src/components/MainHeader.tsx": "Main navigation header with hamburger menu, manual data refresh button, authentication-aware menu items, and logo that displays in Arabic RTL layout.",
  "frontend/src/components/MapView.tsx": "Displays an interactive Leaflet map showing bird observation locations with custom markers, popups containing images, and coordinate validation. Dynamically loads Leaflet library and manages map markers based on filtered valid coordinates.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "Shows a temporary notification alert when the app recovers from a memory issue, with a 5-second countdown timer before auto-dismissing. Displays bilingual (Arabic/English) recovery message with animated styling.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Embeds the official Al Buraimi Governorate map from the National Survey Authority of Oman via an iframe. Provides a responsive, sandboxed view of the official government map.",
  "frontend/src/components/OwlDataTable.tsx": "Empty file with no content.",
  "frontend/src/components/OwlGallery.tsx": "Displays an audio player for bird sounds with play/pause controls. Fetches audio files from blob storage and manages playback state with loading and error handling.",
  "frontend/src/components/OwlImage.tsx": "Empty file with no content.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty file with no content.",
  "frontend/src/components/PermissionManagement.tsx": "Admin interface for managing user roles and permissions, allowing app managers to assign roles (admin/user/guest) to principals. Includes self-access granting functionality and role validation with Arabic UI.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "Lazy-loads a 3D owl model component with fallback to static image placeholder during loading or on error. Implements memory optimization with delayed loading and deferred rendering for performance.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty file with no content.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen animated splash screen with owl image, Arabic title, and decorative elements. Features fade-out transition and enter button to proceed to main application.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "Renders a static, non-interactive 3D map of Al Buraimi Governorate using React Three Fiber, displaying three wilayats with texture mapping, realistic lighting, and a fixed camera angle.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "Manages the official Al Buraimi map display with upload/restore functionality for app managers, including retry logic, backend connectivity checks, and file validation with Arabic UI feedback.",
  "frontend/src/components/StatisticsPage.tsx": "Displays bird species statistics with bar and pie charts using Recharts, showing total birds/locations and distribution by location count, with download and navigation features.",
  "frontend/src/components/TeamDataTable.tsx": "Renders a static RTL Arabic table displaying team members, followers, project manager, and designer information in a responsive horizontal layout.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages the backend actor instance with authentication, automatically invalidating dependent queries when the actor or identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing auth client creation, identity persistence, and login status states.",
  "frontend/src/hooks/useMemoryOptimization.ts": "React hook that monitors memory usage with reduced thresholds (50% warning, 65% critical), triggers automatic recovery by clearing caches, and displays toast notifications for memory optimization events.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for bird data CRUD operations with 10-second auto-refresh, 5-second stale time, and helper functions to invalidate/clear all bird-related query caches including forced data sync on mount.",
  "frontend/src/index.css": "Global Tailwind CSS styles with desert wildlife theme (sand/amber/olive colors), RTL Arabic typography, splash screen animations, transparent owl image backgrounds, and opaque black image viewer backgrounds.",
  "frontend/src/lib/csvExport.ts": "Utility functions to convert bird data arrays to UTF-8 BOM CSV format with Arabic text support, escape CSV fields properly, and trigger browser downloads with timestamped filenames.",
  "frontend/src/lib/excelExport.ts": "Exports bird data to Excel-compatible CSV format with UTF-8 BOM for Arabic text, including headers and summary fields (name, description, location count, image count, audio presence).",
  "frontend/src/lib/memoryManager.ts": "Memory management class that monitors JS heap usage with configurable thresholds (default 50% warning, 65% critical), triggers automatic recovery callbacks, and enforces minimum 20-second intervals between recovery attempts.",
  "frontend/src/lib/pdfExport.ts": "Exports bird data to printable HTML format for PDF generation using native browser print dialog, with RTL Arabic styling and table layout.",
  "frontend/src/lib/requiredAssets.ts": "Registry for build-time validated asset paths (desert owl hero image and owl logo) with runtime validation helpers.",
  "frontend/src/lib/webglDetector.ts": "Detects WebGL support and mobile devices, provides fallback logic, and includes bird name normalization utilities for consistent matching.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with RTL layout displaying desert owl scene, environmental goals in Arabic, Al Buraimi map, and team data table.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme values, animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata tracking the Al Buraimi Owl Tracker application state, including a feature request to restore the Add Data button in BirdDataTable.",
  "unknown.txt": "Empty file with no content."
}