{
  "backend/main.mo": "Motoko canister implementing bird records, user profiles, team data, and access control with blob storage integration and role‑based permissions.",
  "feature_evidence.json": "Feature evidence report listing build‑related features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend files with detailed descriptions of their behavior.",
  "frontend/index.html": "Base HTML entry point that loads the React app via main.tsx with Arabic language settings.",
  "frontend/src/App.tsx": "Main React app file with router setup, lazy‑loaded pages, splash screen, error boundaries, and enhanced loading/error fallbacks.",
  "frontend/src/components/AllLocationsMap.tsx": "Map component showing bird locations with audio, image popups, filtering, and WebGL‑aware behavior.",
  "frontend/src/components/BirdDataTable.tsx": "Admin and user data‑management table for bird records with editing, uploads, deletion, export, and role‑based controls.",
  "frontend/src/components/BirdDetailsPage.tsx": "Displays detailed info for a bird, including images, audio playback, editing fields, and file handling via storage hooks.",
  "frontend/src/components/BirdGallery.tsx": "Shows a gallery of bird species with images, audio, delete options, and navigation to detailed pages.",
  "frontend/src/components/BirdSelector.tsx": "A dropdown selector for choosing a bird from a list, with loading state support.",
  "frontend/src/components/DeferredComponent.tsx": "Delays rendering of heavy components using timed priorities and fallback placeholders.",
  "frontend/src/components/DesertOwlScene.tsx": "Renders a static desert owl hero image with WebGL detection fallback logic.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "Empty placeholder component with no implemented content.",
  "frontend/src/components/EagleOwlPage.tsx": "Displays eagle owl species on an interactive map with filtering, images, and WebGL fallback handling.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches UI errors and shows a styled fallback with retry and home navigation options.",
  "frontend/src/components/ExcelUploader.tsx": "Empty file with no implemented functionality.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Provides a global React error boundary that catches unhandled errors and shows a styled Arabic error screen with reload support.",
  "frontend/src/components/ImageViewPage.tsx": "Full‑screen image viewer with zoom, rotation, navigation, and close controls for browsing image arrays.",
  "frontend/src/components/Interactive3DMap.tsx": "Renders a 3D map using react-three-fiber with WebGL detection and a static 2D fallback for unsupported devices.",
  "frontend/src/components/Interactive3DOwl.tsx": "Displays a 3D owl sprite with optional interaction and a static fallback when WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "Progressively loads gallery items in scroll-triggered batches to reduce memory usage.",
  "frontend/src/components/LazyMapComponent.tsx": "Delays map rendering using a deferred loader and shows a placeholder until initialization completes.",
  "frontend/src/components/MainHeader.tsx": "Main site header with navigation, authentication-aware menu items, and a manual data refresh button.",
  "frontend/src/components/MapView.tsx": "Interactive Leaflet map that loads dynamically, validates coordinates, and shows custom markers with optional image popups.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "Displays an auto‑dismissing notification warning users about a memory‑related UI reload.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Embeds the official Al Buraimi map in a responsive iframe.",
  "frontend/src/components/OwlDataTable.tsx": "Empty placeholder file.",
  "frontend/src/components/OwlGallery.tsx": "Renders a gallery of bird species with images, audio playback, uploads, and detailed modal views.",
  "frontend/src/components/OwlImage.tsx": "Empty placeholder file.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty placeholder file.",
  "frontend/src/components/PermissionManagement.tsx": "UI for assigning user roles, validating principals, and restricting access to app managers.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "Loads a 3D owl viewer with deferred loading and fallback static images for reliability.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty placeholder file.",
  "frontend/src/components/SplashScreen.tsx": "Full‑screen animated splash screen with owl imagery and an enter button triggering a fade‑out transition.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "Renders a non-interactive 3D map of Al Buraimi using react-three-fiber with texture loading, lighting, and a fixed camera view.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "Provides upload, restore, and validation logic for managing the official static Al Buraimi map with retries, backend checks, and UI feedback.",
  "frontend/src/components/StatisticsPage.tsx": "Displays bird and location statistics with charts, data fetching hooks, a custom download-to-image function, and navigation controls.",
  "frontend/src/components/TeamDataTable.tsx": "Shows a static RTL table listing team members, followers, and project roles with basic responsive styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, auto-refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth state, providing login, logout, and stored identity restoration through a React context provider.",
  "frontend/src/hooks/useMemoryOptimization.ts": "React hook that monitors memory usage, triggers recovery, and shows notifications using a memory manager.",
  "frontend/src/hooks/useQueries.ts": "React Query helpers for cache invalidation, forced data sync, and bird‑related query management.",
  "frontend/src/index.css": "Global Tailwind CSS theme and styles, including color variables, splash screen, animations, and layout rules.",
  "frontend/src/lib/memoryManager.ts": "MemoryManager class that monitors JS heap usage, triggers warnings or auto‑recovery, and exposes memory stats.",
  "frontend/src/lib/requiredAssets.ts": "Registry validating required asset paths at build time and providing safe access to them.",
  "frontend/src/lib/webglDetector.ts": "Utility functions to detect WebGL support, decide fallback behavior on mobile, and normalize bird names.",
  "frontend/src/main.tsx": "Application entry point initializing React, QueryClientProvider, and Internet Identity context.",
  "frontend/src/pages/HomePage.tsx": "React page composing the main header, a 3D owl hero scene, goal text, a static map, a team table, and a footer within styled RTL sections.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, extended utilities, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing features, requirements, known build issues, and project state versioning.",
  "unknown.txt": "Empty file with no content."
}