{
  "backend/main.mo": "Main Motoko actor implementing bird tracking system with blob storage, access control, user profiles, team management, and CRUD operations for bird data including locations, images, and audio files.",
  "backend/migration.mo": "Migration module defining type structures for BirdData, UserProfile, and TeamMember, with a run function that preserves all state during canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence issues: uploaded images not displaying after deployment and need for frontend error handling with specific error messages.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including error handling, Arabic RTL interface, lazy loading, memory optimization, 3D visualization, and data synchronization features.",
  "frontend/index.html": "HTML entry point with Arabic language attribute, viewport configuration, and Arabic title for the Al Buraimi owl distribution tracking application.",
  "frontend/src/App.tsx": "Main React application component with lazy-loaded routes, comprehensive error boundaries, memory optimization, forced data sync on load, Arabic RTL interface, and enhanced loading states with automatic fallback handling.",
  "frontend/src/components/AllLocationsMap.tsx": "Interactive map component displaying bird locations in Al Buraimi with popup details, image display with comprehensive error handling and logging, audio playback, filtering, and WebGL detection for 3D features.",
  "frontend/src/components/BirdDataTable.tsx": "Displays a searchable, filterable table of all bird records with CRUD operations (add, delete, view details) and export functionality (Excel, PDF). Includes error logging for data loading and uses React Query hooks for data management.",
  "frontend/src/components/BirdDetailsPage.tsx": "Shows detailed information for a single bird including images, audio, locations, and editable description/notes. Supports file uploads for images and audio with error logging and permission checks.",
  "frontend/src/components/BirdGallery.tsx": "Gallery view of all birds with filtering by images/audio/locations, inline editing, and media upload capabilities. Includes comprehensive error logging and export features.",
  "frontend/src/components/BirdSelector.tsx": "Simple dropdown component for selecting a bird from a list of bird names with loading state and RTL support.",
  "frontend/src/components/DeferredComponent.tsx": "Wrapper component that delays rendering of heavy child components with configurable priority levels to reduce initial memory load and prevent spikes.",
  "frontend/src/components/DesertOwlScene.tsx": "Displays a hero image of a desert owl scene with WebGL detection, falling back to static image to avoid memory issues during build.",
  "frontend/src/components/DesertOwlSceneContent.tsx": "Empty file with no content.",
  "frontend/src/components/EagleOwlPage.tsx": "Page component for displaying eagle owl distribution map with location data loading, error handling, and WebGL support detection.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors, displays a styled Arabic error message with retry functionality, and automatically attempts recovery after 3 seconds.",
  "frontend/src/components/ExcelUploader.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Root-level error boundary that catches all unhandled errors, clears browser caches, and provides a styled Arabic error UI with reload functionality to prevent white screens.",
  "frontend/src/components/ImageViewPage.tsx": "Full-screen image viewer component with zoom, rotation, and navigation controls for browsing through multiple images in a gallery.",
  "frontend/src/components/Interactive3DMap.tsx": "3D map component using Three.js/React Three Fiber that displays Al Buraimi map with WebGL detection and automatic fallback to static 2D image on unsupported devices.",
  "frontend/src/components/Interactive3DOwl.tsx": "3D owl sprite component using Three.js that renders a transparent owl texture with optional rotation and zoom controls, falling back to static image if WebGL is unavailable.",
  "frontend/src/components/LazyGalleryGrid.tsx": "Progressive loading gallery component that renders items in batches with infinite scroll to prevent memory overflow when displaying large image collections.",
  "frontend/src/components/LazyMapComponent.tsx": "Wrapper component that defers map initialization with a loading placeholder to prevent memory spikes during initial page load.",
  "frontend/src/components/MainHeader.tsx": "Main navigation header component with hamburger menu, logo, manual data refresh button, and navigation items for authenticated and unauthenticated users. Supports RTL layout with Arabic labels.",
  "frontend/src/components/MapView.tsx": "Interactive Leaflet map component displaying owl location markers with optional images, coordinate validation, and dynamic popup content. Centers on Al Buraimi Governorate.",
  "frontend/src/components/MemoryRecoveryNotification.tsx": "Notification component that displays a countdown alert when the app recovers from memory issues, auto-dismissing after 5 seconds.",
  "frontend/src/components/OfficialAlBuraimiMap.tsx": "Embeds the official Al Buraimi Governorate map from the National Survey Authority of Oman in a responsive iframe.",
  "frontend/src/components/OwlDataTable.tsx": "Empty file with no content.",
  "frontend/src/components/OwlGallery.tsx": "Audio player component for bird sounds with play/pause controls, loading states, and fallback UI when no audio is available.",
  "frontend/src/components/OwlImage.tsx": "Empty file with no content.",
  "frontend/src/components/OwlTableHeader.tsx": "Empty file with no content.",
  "frontend/src/components/PermissionManagement.tsx": "Admin panel for managing user roles (admin, user, guest) via Principal IDs, with self-grant functionality and ingress_expiry error handling.",
  "frontend/src/components/SafeInteractive3DOwl.tsx": "Lazy-loaded 3D owl model component with static image fallback, error handling, and deferred loading to optimize memory usage.",
  "frontend/src/components/SpecialistManagement.tsx": "Empty file with no content.",
  "frontend/src/components/SplashScreen.tsx": "A splash screen component with fade-out animation that displays an owl image, Arabic title, and an enter button with decorative background elements.",
  "frontend/src/components/Static3DAlBuraimiMap.tsx": "A static 3D map visualization of Al Buraimi Governorate using Three.js/React Three Fiber, displaying a textured plane with realistic lighting and fixed camera position.",
  "frontend/src/components/StaticAlBuraimiMap.tsx": "A component for displaying and managing the official Al Buraimi map image with upload/restore functionality, retry logic, and permission checks for app managers.",
  "frontend/src/components/StatisticsPage.tsx": "A statistics dashboard displaying bird data using bar and pie charts (Recharts), showing species distribution, location counts, and media statistics with loading/error states.",
  "frontend/src/components/TeamDataTable.tsx": "A responsive RTL table component displaying team information including followers, members, project manager, and designer in Arabic.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that manages the backend actor instance, handling authentication state and initializing access control with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMemoryOptimization.ts": "Custom React hook that monitors memory usage with configurable thresholds (50% warning, 65% critical), triggers automatic recovery by clearing caches, and displays toast notifications for memory events.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for bird data operations with 10-second auto-refresh, 5-second stale time, and helper functions to invalidate or clear all bird-related cache queries.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with desert wildlife theme (sand/amber/olive colors), RTL Arabic typography, splash screen animations, and mobile-responsive styles for image views and site manager sections.",
  "frontend/src/lib/csvExport.ts": "Utility functions to convert bird data arrays to UTF-8 BOM CSV format with Arabic headers, escape special characters, format locations/images, and trigger browser downloads with timestamps.",
  "frontend/src/lib/excelExport.ts": "Exports bird data to Excel-compatible CSV format with UTF-8 BOM for Arabic text support, including summary fields like location count, image count, and audio presence indicators.",
  "frontend/src/lib/memoryManager.ts": "Provides automatic memory monitoring with configurable thresholds (50% warning, 65% critical) and recovery mechanisms to prevent browser crashes by triggering cleanup callbacks when memory usage is high.",
  "frontend/src/lib/pdfExport.ts": "Exports bird data to printable HTML/PDF format using native browser print APIs, generating styled Arabic RTL tables with bird information including names, descriptions, locations, and media counts.",
  "frontend/src/lib/requiredAssets.ts": "Registry for build-time validated asset paths (desert owl hero image and owl logo) with runtime validation helpers to fail fast on missing assets.",
  "frontend/src/lib/webglDetector.ts": "Detects WebGL support (v1/v2) and mobile devices, recommending fallback rendering on mobile; also provides bird name normalization utilities for consistent matching.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with RTL Arabic layout displaying a desert owl scene hero, environmental goals aligned with Oman Vision 2040, Al Buraimi map, and team data table.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme for sidebar/chart colors, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking a deployment issue where bird data and images stopped displaying after version 520 deployment. Contains pending feature requests to investigate database migration, stable memory transfer, blob storage paths, and access control issues.",
  "unknown.txt": "Empty file with no content."
}